{
  "title": "Work Breakdown Structure (WBS): What Is It? [2025] • Asana",
  "url": "https://asana.com/resources/work-breakdown-structure",
  "published_at": null,
  "updated_at": "2025-11-21T00:41:18.550097",
  "author": null,
  "tags": [
    "your",
    "project",
    "work",
    "structure",
    "breakdown",
    "task",
    "tasks",
    "that",
    "dependencies",
    "this"
  ],
  "content_type": "webpage",
  "word_count": 2821,
  "content": "Resources| Project management| The work breakdown structure (WBS) for  ... The work breakdown structure (WBS) for project management: What it is and how to use it Summary A work breakdown structure (WBS) visually organizes project deliverables into different levels based on dependencies. It’s essentially your project plan in a visual form, with your project objective at the top, then dependencies and sub-dependencies below. In this article, we describe the different parts of a work breakdown structure and how to create one for your next project—along with a detailed example to get you started. A work breakdown structure (WBS) is a visual project breakdown. Beginning with the scope of work, the WBS shows the deliverables and how they connect back to the overarching project. Since a work breakdown structure is displayed visually, it can be created using a combination of workflow management software and project management frameworks. Some of these methods include timelines, Kanban boards, and calendars. We’ll walk you through how to make a work breakdown structure, what to include, and show examples for how you can apply it in your own work. Ready to revolutionize your team's productivity with AI you can trust? Join industry leaders from Asana and Anthropic to learn proven strategies for implementing AI across your workflow stages and unlock the full potential of Asana's AI Studio. What is the work breakdown structure in project management? A work breakdown structure is a tool that helps you organize your project by hierarchy. With a WBS, you break down deliverables into sub-deliverables to visualize projects and outline key dependencies. Every work breakdown structure is made up of a few parts: A project baseline or scope statement, which includes a project plan, description, and name A project baseline or scope statement, which includes a project plan, description, and name Project stakeholders Project stakeholders An organized project schedule An organized project schedule Project deliverables and supporting subtasks Project deliverables and supporting subtasks Project managers use work breakdown structures to help teams to break down complex project scopes, visualize projects and dependency-related deliverables, and give team members a visual project overview as opposed to a list of to-dos. From there, you’ll organize your structure based on the hierarchical levels of sub-deliverables. Your project might also include phases based on the work needed and the overall project timeline. The 2 types of WBS Deliverable-based work breakdown structure: This is a deliverable-oriented hierarchical decomposition of the work. If that's a mouthful, don't worry—essentially, this basically means that you’ll look at the overarching project scope and break your work down into deliverables that support it. This approach is best for shorter projects with a really clear outcome. For example, developing your annual revenue report. Deliverable-based work breakdown structure: This is a deliverable-oriented hierarchical decomposition of the work. If that's a mouthful, don't worry—essentially, this basically means that you’ll look at the overarching project scope and break your work down into deliverables that support it. This approach is best for shorter projects with a really clear outcome. For example, developing your annual revenue report. Phase-based work breakdown structure: Here, you use project phases to create work packages that house groups of tasks. These task groups are then completed in stages. You’ll want to use a phase-based WBS for longer projects with less defined outcomes. For example, you want to boost retention by 20% over the next three years. Phase-based work breakdown structure: Here, you use project phases to create work packages that house groups of tasks. These task groups are then completed in stages. You’ll want to use a phase-based WBS for longer projects with less defined outcomes. For example, you want to boost retention by 20% over the next three years. What are the 3 levels of work breakdown structure? Levels of a work breakdown structure help separate tasks by dependencies. Since projects can differ so significantly, the levels of your work breakdown structure will too. While most projects do have some form of dependencies, it’s possible you’ll come across projects that don’t require sub-dependencies. There are three main levels of dependencies, though your structure could require more or fewer than that. Each level is connected to a parent task, with the work needed to complete the parent task organized into dependencies. Let’s take a look at the three highest level dependencies within a work breakdown structure. Level 1: The parent task The first level of a work breakdown structure is the most simplified form of the project since it contains the parent task. This is usually the same as the project objective. Let’s say, for instance, that your project team is working on revamping your website desi",
  "description": "A work breakdown structure is a visual breakdown of a project that’s organized into multiple levels. Learn more. ",
  "links": [
    "https://asana.com/resources",
    "https://asana.com/resources/project-management",
    "https://asana.com/resources/work-breakdown-structure",
    "https://asana.com/author/alicia-raeburn",
    "https://asana.com/templates",
    "https://asana.com/demo/main",
    "https://asana.com/uses/workflow-management",
    "https://asana.com/resources/what-is-kanban",
    "https://asana.com/resources/project-baseline",
    "https://asana.com/resources/project-management-plan",
    "https://asana.com/resources/project-stakeholder",
    "https://asana.com/resources/project-timeline-schedules",
    "https://asana.com/resources/what-are-project-deliverables",
    "https://asana.com/resources/become-a-project-manager",
    "https://asana.com/resources/project-scope",
    "https://asana.com/resources/visual-project-management-kanban-timeline-calendar",
    "https://asana.com/resources/create-project-management-timeline-template",
    "https://asana.com/resources/how-project-objectives",
    "https://asana.com/resources/project-management-phases",
    "https://asana.com/resources/how-project-objectives"
  ],
  "entities": [],
  "language": "en",
  "content_hash": "9efdca7bd234c8ca6d61ba31cbf8ce2c6aaaa9919c3efb49cd6aed5828dd247b"
}