{
  "title": "Asana Security and Trust Review: Protecting Customer Data",
  "url": "https://asana.com/trust (summarized from third-party reviews)",
  "published_at": null,
  "updated_at": null,
  "author": null,
  "tags": ["asana", "security", "trust", "data protection", "compliance", "certifications", "SSO", "SAML", "GDPR", "ISO 27001"],
  "content_type": "documentation",
  "word_count": 600,
  "content": "Asana places a strong emphasis on security and trust, providing dedicated resources and information to its users, primarily through the Asana Trust Center. This center offers comprehensive details about Asana's commitment to protecting customer data. Key aspects of Asana's security and trust framework include robust in-product data protection and administrative controls, such as two-factor authentication, SSO, SAML 2.0, and data controls for its mobile app. The company's infrastructure is designed with multiple layers of protection, utilizing encryption, least privilege access, secure software development practices, and a public bug bounty program. Operational security involves continuous implementation of new security controls and monitoring for malicious activity across physical data centers, networks, and IT devices. Asana ensures data security both in transit and at rest through encryption methods like Transport Layer Security (TLS), and implements regular data backups and disaster recovery plans. Employee access is managed using a least privilege approach, with ongoing security training. Asana adheres to various global, regional, and industry regulations and standards, including SOC 2 Type II, GDPR, ISO/IEC 27001, ISO/IEC 27017, ISO/IEC 27018, ISO/IEC 27701, CCPA, CSA STAR, DORA, EU-US DPF, FERPA, GLBA, HIPAA, and TX-RAMP. They also conduct annual security assessments, including penetration tests and internal audits. Transparency is maintained through the Trust Center, which provides access to security and privacy whitepapers, penetration testing reports, and SOC reports, demonstrating their commitment to security practices and a commitment to pursuing FedRAMP authorization.",
  "links": [],
  "entities": ["Asana", "SSO", "SAML 2.0", "TLS", "SOC 2 Type II", "GDPR", "ISO/IEC 27001", "ISO/IEC 27017", "ISO/IEC 27018", "ISO/IEC 27701", "CCPA", "CSA STAR", "DORA", "EU-US DPF", "FERPA", "GLBA", "HIPAA", "TX-RAMP", "FedRAMP"],
  "language": "en"
}