{
  "title": "RACI Charts: The Ultimate Guide, with Examples [2025] • Asana",
  "url": "https://asana.com/resources/raci-chart",
  "published_at": null,
  "updated_at": "2025-11-21T00:41:17.185356",
  "author": null,
  "tags": [
    "project",
    "raci",
    "responsible",
    "your",
    "team",
    "task",
    "accountable",
    "informed",
    "with",
    "chart"
  ],
  "content_type": "webpage",
  "word_count": 2398,
  "content": "Resources| Project management| Your guide to RACI charts, with examples Your guide to RACI charts, with examples Can you identify exactly who’s doing what by when for each task, milestone, and deliverable in your project? If not, you might need a RACI chart. RACI is an acronym to help teams clarify project roles and figure out who the responsible party is for any given task. Whether you've never heard of RACI before or you’re considering creating a RACI chart for your next project, here’s everything you need to know about how to create and use these charts. Prepare for the unexpected with Asana's business continuity plan templates. Ensure that your organization stays resilient and operational, even during disruptions. What is a RACI chart? A RACI chart (sometimes called a Responsibility Assignment Matrix) is a way to identify your project teams’ roles and responsibilities for any task, milestone, or project deliverable. By following the RACI acronym, you can clarify responsibility and reduce confusion. RACI stands for: Responsible This person is directly in charge of the work. There should only ever be one Responsible role per task so you know who to go to with questions or updates. If a task has more than one Responsible person, you can lose clarity and cause confusion. Instead, aim to add additional collaborators as some of the other RACI roles, which can have more than one person. Accountable The Accountable person is responsible for overseeing overall task completion, though they may not be the person actually doing the work. There are two ways to assign an Accountable role. Sometimes, the Accountable is the project manager (or even the Responsible, though in that case the person is taking on two different roles during the task workflow). In these cases, the Accountable is responsible for making sure all of the work gets done. In other cases, the Accountable is a senior leader or executive who is responsible for approving the work before it’s considered complete. Like the Responsible role, there should only ever be one Accountable. Consulted This will be the person or people who should review and sign off on the work before it’s delivered. There may be multiple Consulted roles for each task, project milestone, or deliverable. Informed This is the person or group of people who are informed about the progress and completion of work. They probably are not involved in any other aspect of the deliverable. When should I create RACI charts? RACI charts are a helpful way to track each stakeholder’s role for a task, milestone, or deliverable—especially if you’re managing a complex project with many decision makers and subject matter experts. With a RACI chart, you can prevent poor decision making and avoid roadblocks in the approvals process that could impact overall project success. These charts, while different from PERT charts, are especially useful if your stakeholders may be taking on different roles throughout the project. For example, there could be a stakeholder who is Responsible on one deliverable but Informed on another. With a RACI chart, you can clearly outline these details and make sure everyone knows who’s responsible for what. How to make a RACI chart Ever felt like your project was spinning out of control, with team members unsure of their roles and responsibilities? You're not alone. This is when a RACI chart comes in handy. Let's walk through the steps of creating a RACI diagram with a software development project as an example. Step 1: List the project tasks Start by breaking down your project into specific activities or deliverables. For our software project, tasks might include: Define project scope Define project scope Design wireframes Design wireframes Develop front-end code Develop front-end code Conduct user testing Conduct user testing Launch the site Launch the site These tasks cover key phases in the project lifecycle and give team members a clear understanding of what needs to be accomplished from start to finish. Step 2: Identify key stakeholders Next, identify all the roles involved in your project, from team members to stakeholders. For our RACI chart example, we might have: Project Manager: Oversees the entire project. Project Manager: Oversees the entire project. Business Analyst: Gathers requirements and ensures they’re met. Business Analyst: Gathers requirements and ensures they’re met. UX Designer: Responsible for creating wireframes and the user experience. UX Designer: Responsible for creating wireframes and the user experience. Front-End Developer: Codes the website. Front-End Developer: Codes the website. Marketing Team: Needs to be informed of key milestones for launch coordination. Marketing Team: Needs to be informed of key milestones for launch coordination. IT Support: Handles post-launch maintenance. IT Support: Handles post-launch maintenance. This step ensures that no team member is left in the dark and that all informed parties are represented. Step 3: Assign ",
  "description": "Clarify responsibility and reduce confusion. RACI charts help teams figure out who the responsible party is for any given task. Learn more.",
  "links": [
    "https://asana.com/resources",
    "https://asana.com/resources/project-management",
    "https://asana.com/resources/raci-chart",
    "https://asana.com/author/julia-martins",
    "https://asana.com/templates",
    "https://asana.com/demo/main",
    "https://asana.com/templates/business-continuity-plan?utm_source=article-banner&utm_medium=web&utm_campaign=continuity_plan",
    "https://asana.com/resources/what-are-project-deliverables",
    "https://asana.com/resources/project-milestones",
    "https://asana.com/resources/pert-chart",
    "https://asana.com/resources/project-stakeholder",
    "https://asana.com/templates/raci-matrix",
    "https://asana.com/resources/roles-and-responsibilities",
    "https://asana.com/resources/team-collaboration-tips",
    "https://asana.com/uses/project-management",
    "https://asana.com/resources/visual-project-management-kanban-timeline-calendar",
    "https://asana.com/resources/introduction-to-work-management",
    "https://asana.com/templates/raci-matrix",
    "https://asana.com/resources/resource-management-plan",
    "https://asana.com/resources/promotion-strategy"
  ],
  "entities": [],
  "language": "en",
  "content_hash": "cceb573841aa33d204f255dbe4217619be998818652c3b648118e0d17788a016"
}