{
  "title": "Asana Apps and Integrations • Asana",
  "url": "https://asana.com/apps",
  "published_at": null,
  "updated_at": "2025-11-28T15:40:16.893181",
  "author": null,
  "tags": [
    "asana",
    "your",
    "with",
    "tasks",
    "communication",
    "management",
    "productivity",
    "operations",
    "reporting",
    "from"
  ],
  "content_type": "webpage",
  "word_count": 10100,
  "content": "Filter results× Collections Featured Enterprise IT Microsoft Google Made by Asana Categories Communication Connectors Files Finance and HR IT and Development Marketing and Design Operations Product Management Productivity Reporting Sales and Services Security and Compliance Time Tracking All Apps Partner Types Strategic Partner Premier Partner Platform Partner Your favorite apps in one place Connect with the app integrations your team uses every day Amazon Q index Connectors, IT & Development, Productivity Make a bigger impact with your AI workflows in Asana by powering them with context from the other apps you already use. Microsoft Teams Communication Connect your team’s conversations to actionable items in Asana. Splunk New, Security and Compliance Automate audit log ingestion, alerting, and visualization with the Asana for Splunk integration. Entra ID IT and Development Securely access Asana using your existing corporate credentials and automate provisioning to gain time back. Tableau Reporting Unlock your team’s work data to make smarter business decisions Asana Android and iOS mobile apps Made by Asana, Google Download the Asana mobile app for your iPhone, iPad, or Android device to plan your day, share ideas, and get team updates on the go. ServiceNow IT and Development Turn ServiceNow requests into Asana tasks and back with real-time 2-way sync without writing a single line of code. Google Drive Files Easily attach Google Drive files to tasks in Asana and receive comment notifications to keep teams and work connected. IBM App Connect IT and Development Get more out of Asana and your applications with data automation powered by IBM App Connect. Looker Reporting, IT and Development Explore, analyze, and share real-time business analytics with actionable Looker dashboards in Asana Vimeo Communication Seamlessly record and embed Vimeo videos right in Asana to increase team engagement and collaboration. Aureum New, Reporting Put your customer data to work. Canva Marketing and Design Design made amazingly simple and fun with Canva’s drag-and-drop editor. Create, embed, and collaborate on stunning designs. Figma Marketing and Design Turn ideas into next steps with the Asana widget for Figma and FigJam. Share design work in Asana with live Figma embeds. Instagantt Productivity Create a Gantt chart, schedule tasks in a timeline, and set start dates and dependency lines. Vanta Security and Compliance Simplify and centralize your compliance and security workflows to build trust. Transcend Security and Compliance Orchestrate data across dozens of data systems to automate data subject requests. Claris Connect Connectors, IT and Development Automate your business by syncing multi-app workflows directly with Asana. Exterro Security and Compliance Proactively analyze, collect, and secure data stored in Asana. Flowsana Connectors, IT and Development Enhanced workflow automation for Asana. OneDrive Files Easily attach files from OneDrive to Asana, and use Asana Rules to automatically upload a task attachment to a OneDrive folder. Wistia Marketing and Design, Communication Get on the same page faster by using your Wistia videos to super-charge Asana tasks. Luciq IT and Development Get an annotated screenshot and device details with your bug reports by integrating Luciq and Asana. Devart ODBC Driver Connectors, Files This high-performance connectivity tool fully supports ODBC API functions and data types to enable easy access to live Asana data from anywhere. WebWork Time Tracker Productivity Easily keep your Asana projects and tasks on track. Maximize productivity with insightful reports about your team’s performance. Everhour Productivity, Finance and HR, Time Tracking Track time, estimate tasks, set up a fixed-fee or recurring budget for your projects — all that and more without ever leaving Asana. Happeo Communication With the Happeo Search integration, you can search for Asana tasks directly from Happeo’s next-gen intranet platform. Neuralmind Communication With the Neuralmind chat widget, you can access your Asana tasks and more to improve collaboration and ease of access. EasyTasker.io Marketing and Design, Sales and Services Create, see, and complete tasks from anywhere (from email, social media, any website, and 20+ more). Dropbox Files The Dropbox + Asana integration helps teams easily attach Dropbox files to a task from the task pane, and use Asana Rules to automatically upload files to a Dropbox folder. Stack Moxie Operations, Product Management Automated QA, monitoring and testing for Sales and Marketing Ops. TaskBill.io Productivity, Connectors, Time Tracking Effortlessly track time spent on Asana tasks and invoice your clients. Statussync Communication Simplify the way you manage and monitor third-party services with a comprehensive dashboard that gives you real-time status updates on outages and more. Commented Communication, Product Management No more juggling between scattered conversations. Speed up ",
  "description": "Asana connects with tools like Slack, Dropbox, Instagantt, and Google Drive to make tracking your work even easier. See the full list of integrations.",
  "links": [
    "https://asana.com/partners",
    "https://asana.com/apps/slack",
    "https://asana.com/apps/google-drive",
    "https://asana.com/apps/everhour",
    "https://asana.com/apps/microsoft",
    "https://asana.com/apps/amazon-q-index",
    "https://asana.com/apps/microsoft",
    "https://asana.com/apps/splunk",
    "https://asana.com/apps/entraid",
    "https://asana.com/apps/tableau",
    "https://asana.com/apps/asana",
    "https://asana.com/apps/servicenow",
    "https://asana.com/apps/google-drive",
    "https://asana.com/apps/ibm-app-connect",
    "https://asana.com/apps/looker",
    "https://asana.com/apps/vimeo",
    "https://asana.com/apps/aureum",
    "https://asana.com/apps/canva",
    "https://asana.com/apps/figma",
    "https://asana.com/apps/instagantt"
  ],
  "entities": [],
  "language": "en",
  "content_hash": "e9c14c53fb7ee90ae26abcfdbb15dc8875cb14a553d92170de6ecbf968acbe79"
}