{
  "title": "Free Project Templates & AI Workflows Gallery • Asana",
  "url": "https://asana.com/templates",
  "published_at": null,
  "updated_at": "2025-11-21T00:41:32.370695",
  "author": null,
  "tags": [
    "template",
    "your",
    "project",
    "more",
    "plan",
    "work",
    "track",
    "with",
    "workflow",
    "manage"
  ],
  "content_type": "webpage",
  "word_count": 421,
  "content": "AI workflow template gallery Work faster by selecting an AI workflow template that’s ready to handle your team’s routine work. By signing up, I agree to Asana's Terms of Service and acknowledge the Privacy Statement. Explore by team Marketing Manage your next campaign, build a content calendar, and more. Operations and PMO Create an operations project plan, track your company goals, and more. Design Jump-start your creative production, web design process, and more. IT Build a software implementation plan, track bug reports, and more. Product and engineering Plan your upcoming sprints, build engineering project plans, and more. HR Track candidates in the hiring process, build new-hire checklists, and more. Sales and CX Design your sales plan, manage top accounts, and more. Featured AI workflow templates Project timeline template Learn how to keep a project on track—and ensure success—by creating a project timeline template. Creative requests From initial intake to final deliverables, keep your creative production process running smoothly with this creative request template. Meeting agenda Clarify meeting goals, define team responsibilities, and put the meaning back into meetings with a free meeting agenda template from Asana. Event planning Coordinate your next event with Asana’s free event planning template. Plan your budget, collaborate, and track event tasks all in one place. Work requests Use this template to centralize, prioritize, and manage teams so everyone stays focused and meets deadlines Cross-functional project plan Creating a project plan from scratch but don’t know where to start? Our tips and template can take you from plans to action. Discover more AI workflow templates IT requests Bugs, tickets, requests—it’s a lot to manage. Instead, track everything with our IT request template Customer feedback Collect customer feedback in one place to finally figure out what they love and loathe. Get started. Creative asset feedback and approvals What if you could share designs and manage reviews in one template? You’d get actionable feedback, faster approvals, and better work. Kanban board Visualize your workflow with a Kanban board. Quickly see the stage and progress of each task. Web production template Let our template help you coordinate a web production schedule—even if producers and web developers work out of different tools. Marketing project plan Our template guides you through project management best practices for marketing teams so you can get from strategy to tactics to results. AppLovin content calendar template Use AppLovin's template to track the type of content, status of work, and primary channel of everything your team is publishing each month. Transform the way you work with Asana",
  "description": "Discover Asana’s free project templates and AI workflows to plan, manage, and automate any process faster. Browse the gallery and get started today.",
  "links": [
    "https://asana.com/terms/terms-of-service",
    "https://asana.com/terms/privacy-statement",
    "https://asana.com/templates/marketing",
    "https://asana.com/templates/operations-pmo",
    "https://asana.com/templates/design",
    "https://asana.com/templates/it",
    "https://asana.com/templates/product-engineering",
    "https://asana.com/templates/hr",
    "https://asana.com/templates/sales-cx",
    "https://asana.com/templates/all",
    "https://asana.com/templates/project-timeline",
    "https://asana.com/templates/creative-requests",
    "https://asana.com/templates/meeting-agenda",
    "https://asana.com/templates/event-planning ",
    "https://asana.com/templates/work-requests",
    "https://asana.com/templates/cross-functional-project-plan",
    "https://asana.com/templates/all",
    "https://asana.com/templates/it-requests",
    "https://asana.com/templates/customer-feedback ",
    "https://asana.com/templates/creative-asset-feedback-and-approval "
  ],
  "entities": [],
  "language": "en",
  "content_hash": "90ce11114b26714bbfb631fbeb94ed48d9b45ce81211ad9f5bc1efe61036254e"
}