{
  "title": "Asana Pricing | Personal, Starter, Advanced, & Enterprise plans • Asana",
  "url": "https://asana.com/pricing",
  "published_at": null,
  "updated_at": "2025-11-21T00:41:29.520660",
  "author": null,
  "tags": [
    "with",
    "asana",
    "unlimited",
    "studio",
    "your",
    "custom",
    "management",
    "support",
    "project",
    "admin"
  ],
  "content_type": "webpage",
  "word_count": 2531,
  "content": "Pick the plan that fits your team Personal For one or two people managing personal projects. Free forever Manage tasks and personal to-dos: 2 users 2 users Unlimited tasks Unlimited tasks Unlimited projects Unlimited projects Unlimited messages Unlimited messages Activity logs Activity logs Unlimited storage, 100MB max per file Unlimited storage, 100MB max per file List, board, and calendar views List, board, and calendar views Basic search filters Basic search filters Status updates Status updates iOS and Android mobile apps iOS and Android mobile apps Time tracking with integrations - Learn more Time tracking with integrations - Learn more 100+ free integrations with your favorite apps - Learn more 100+ free integrations with your favorite apps - Learn more Starter For growing teams that need to track their projects' progress and hit deadlines. Per user, per month billed annually. US$13.49 billed monthly Everything in Personal, plus: Asana AI Asana AI AI Studio (with additional credits for purchase) AI Studio (with additional credits for purchase) No user seat limits No user seat limits Timeline and Gantt view Timeline and Gantt view Workflow builder Workflow builder Project dashboards Project dashboards Universal reporting Universal reporting Advanced search Advanced search Custom fields Custom fields Forms Forms Unlimited automations Unlimited automations Start dates and times Start dates and times Custom project templates Custom project templates Admin console Admin console Private teams and projects Private teams and projects Unlimited free guests Unlimited free guests Advanced For companies that need to manage a portfolio of work and goals across departments. Per user, per month billed annually. US$30.49 billed monthly Everything in Starter, plus: Asana AI Asana AI AI Studio (with additional credits for purchase) AI Studio (with additional credits for purchase) Goals Goals Unlimited portfolios Unlimited portfolios Portfolio workload Portfolio workload Integrations with Salesforce, Tableau, and Power BI Integrations with Salesforce, Tableau, and Power BI Forms branching and customization Forms branching and customization Approvals Approvals Proofing Proofing Lock custom fields Lock custom fields Native time tracking Native time tracking Scaled security Scaled security Enterprise For companies that need to coordinate and automate complex work across departments, without limits. Contact sales for pricing Everything in Advanced, plus: Asana AI Asana AI AI Studio (with additional credits for purchase) AI Studio (with additional credits for purchase) Workflow bundles Workflow bundles Resource management Resource management SAML SAML Expedited user set up with SCIM Expedited user set up with SCIM Service accounts Service accounts Guest invite permissions Guest invite permissions Mobile app controls Mobile app controls Admin announcements Admin announcements Project admin controls Project admin controls Team membership admin controls Team membership admin controls Custom branding Custom branding 24/7 support 24/7 support Enterprise+ For companies that need to meet strict compliance requirements with flexible, precise controls. Everything in Enterprise, plus: Asana AI Asana AI AI Studio (with additional credits for purchase) AI Studio (with additional credits for purchase) Audit log API Audit log API SIEM integration support SIEM integration support Data loss prevention integration support Data loss prevention integration support eDiscovery integration support eDiscovery integration support Archiving integration support Archiving integration support Managed workspaces Managed workspaces Data residency, see requirements Data residency, see requirements Enterprise Key Management, subject to eligibility Enterprise Key Management, subject to eligibility HIPAA compliance available, see requirements HIPAA compliance available, see requirements Trusted guest domains Trusted guest domains App management App management Personal For one or two people managing personal projects. Free forever Manage tasks and personal to-dos: 2 users 2 users Unlimited tasks Unlimited tasks Unlimited projects Unlimited projects Unlimited messages Unlimited messages Activity logs Activity logs Unlimited storage, 100MB max per file Unlimited storage, 100MB max per file List, board, and calendar views List, board, and calendar views Basic search filters Basic search filters Status updates Status updates iOS and Android mobile apps iOS and Android mobile apps Time tracking with integrations - Learn more Time tracking with integrations - Learn more 100+ free integrations with your favorite apps - Learn more 100+ free integrations with your favorite apps - Learn more Starter For growing teams that need to track their projects' progress and hit deadlines. Per user, per month billed annually. US$13.49 billed monthly Everything in Personal, plus: Asana AI Asana AI AI Studio (with additional credits for purchase) AI Studio (with additional credits ",
  "description": "Explore Asana's flexible pricing plans and find the right solution to help your team stay organized, connected, and on track.",
  "links": [
    "https://asana.com/apps?category=time-tracking",
    "https://asana.com/apps",
    "https://asana.com/sales",
    "https://asana.com/sales",
    "https://asana.com/apps?category=time-tracking",
    "https://asana.com/apps",
    "https://asana.com/sales",
    "https://asana.com/sales",
    "https://asana.com/sales",
    "https://asana.com/sales",
    "https://asana.com/apps",
    "https://asana.com/customer-success",
    "https://asana.com/product/ai/ai-studio#pricing",
    "https://asana.com/sales",
    "https://asana.com/sales",
    "https://asana.com/sales?utm_source=web_cta&utm_medium=website&utm_campaign=timesheets_budget_contact_sales",
    "https://asana.com/trust",
    "https://asana.com/students",
    "https://asana.com/guide/help/organizations/basics",
    "https://asana.com/industry/nonprofit"
  ],
  "entities": [],
  "language": "en",
  "content_hash": "cd16f687821f0d11ad820e2243c0a0616b116e0eecfc48f3744a3513600c5847"
}