{
  "title": "monday.com pricing and plans",
  "url": "https://monday.com/pricing",
  "published_at": null,
  "updated_at": "2025-11-21T00:41:59.618337",
  "author": null,
  "tags": [
    "your",
    "monday",
    "plan",
    "with",
    "data",
    "free",
    "from",
    "work",
    "team",
    "more"
  ],
  "content_type": "webpage",
  "word_count": 1342,
  "content": "Supercharge your teamwork. Start free. Unlimited boards and workflows. No credit card needed. Free$0free foreverUp to 2 seatsTry for freeFor individuals looking to keep track of their workUp to 3 boardsBoards are the place for organizing all your work and data (e.g. projects, clients, processes).Up to 3 DocsCreate docs and collaborate with your team in real time. As your collaboration thrives, turn those words into actions with live updated data using monday.com Real Time Engine!200+ templatesChoose from over 200+ templates for every industry, and customize them to fit your team's needs.8 column typesBuild your board the way you want with a variety of column types.iOS and Android appsStay connected on-the-go and access monday.com from your smart phone. Basic$9seat / monthTotal$90/ monthBilled annuallyTry for freeManage all your team’s work in one placeUnlimited free viewersGive viewers read-only access to data within your account.Unlimited itemsCreate & keep track of any information, including tasks, projects, & customers.5GB file storageStore and easily find the project files you need.Prioritised customer supportEnjoy all the benefits of our unmatched support team.Create a dashboard based on 1 boardGain insights about your work by visualizing your data in different ways.Trial AI creditsNewStart exploring with free AI credits. Buy more whenever you need them. Standard$12seat / monthTotal$120/ monthBilled annuallyTry for freeCollaborate & optimize your work across teamsTimeline & Gantt viewsSee all upcoming work in a visual timeline & use Gantt charts to ensure you're meeting deadlines successfully.Calendar ViewManage all your upcoming work using a visual calendar.Guest accessCollaborate on specific projects with outside users without giving them access to your full account.Automations (250 actions per month)Automate repetitive work by setting customizable actions within your boards.Integrations (250 actions per month)Connect monday.com with the tools you already use to centralize all your team's work.Create a dashboard that combines 5 boardsDashboards are free, each Dashboard can combine data from 1, 5, 10 or 50 boards, depending on your plan.Trial AI creditsNewStart exploring with free AI credits. Buy more whenever you need them. ProMost Popular$19seat / monthTotal$190/ monthBilled annuallyTry for freeStreamline complex workflows at scalePrivate boardsPrivate boards are only visible and accessible to you and team members you invite.Chart ViewVisualize your data with various types of charts and graphs.Time trackingTrack and monitor the time spent on each task.Formula ColumnUse formulas to perform dynamic calculations on your data.Automations (25K actions per month)Set automated actions in your board to boost your workflow.Integrations (25K actions per month)Integrate your apps and services to move the data you need to and from monday.com.Create a dashboard that combines 20 boardsDashboards are free, each Dashboard can combine data from 1, 5, 10 or 50 boards, depending on your plan.Trial AI creditsNewStart exploring with free AI credits. Buy more whenever you need them. EnterpriseContact salesGet exclusive features for your organizationPortfolio managementConnect projects to a unified portfolio with real-time health snapshots, making it easy to monitor progress, risks, and alignment across initiatives.Resource managementPlan and balance your team’s workload with tools to assign resources, centralize workforce data, and optimize capacity across projects.Enterprise-scale automations & integrationsIncludes 250K automation & integration actions per month.Multi-level permissionsRobust permissions at every level to give you full control.Enterprise-grade security & governanceGet top-tier security features & user management controls.Advanced reporting & analyticsSlice and dice everything and get actionable insights from the data.Create a dashboard that combines 50 boardsBigger dashboards that can pull high level insights from up to 50 boards per dashboard.Trial AI creditsNewStart exploring with free AI credits. Buy more whenever you need them.Enterprise support24/7 quality support with a priority queue included. • • • • • Complete features list Bring AI into your workwith monday.com 245,000+\n customers worldwide rely on \nmonday.com Thanks to monday.com, we are now able to budget the team’s time and efforts much more scientifically, leading to increased operational efficiency.Samyuktha Shivakumar | Global Marketing Operation Manager, Thoughtworks With monday.com, we’re 30% more efficient at delivering hundreds of campaigns seen by millions of customers.Tye Rapley-Hawkins | Head of Delivery at 02 Priority, Telefonica Since adopting monday.com, our global marketing department has seen a 40% improvement in cross-team collaboration for successful end-to-end campaign planning and execution.Sarah Pharr  | AVP, Marketing, Genpact • • • Frequently Asked Questions Is there a free version of monday.com?monday.com has a free pl",
  "description": "Starting from $9 per user per month, monday.com’s pricing has a plan for everyone.",
  "links": [
    "https://monday.com/sales/contact-us?from=pricing&source=Website%20-%20Contact%20Sales",
    "https://monday.com/blog/product/monday-com-pricing-which-plan-is-right-for-you/",
    "https://monday.com/sales/contact-us?from=pricing&source=Website%20-%20Contact%20Sales",
    "https://monday.com/nonprofits"
  ],
  "entities": [],
  "language": "en",
  "content_hash": "d37af57c5ed309d30f8330357daacaf9fcffba8df310f7e6de396b166dd92bf9"
}