{
  "title": "About Us: Trello History, Logos & Customers | Trello",
  "url": "https://trello.com/about",
  "published_at": null,
  "updated_at": "2025-11-21T00:41:51.297135",
  "author": null,
  "tags": [
    "trello",
    "creek",
    "that",
    "with",
    "million",
    "software",
    "teams",
    "from",
    "summer",
    "begins"
  ],
  "content_type": "webpage",
  "word_count": 688,
  "content": "About Trello What’s behind the boards. The way your team works is unique — so is Trello. Trello is the flexible work management tool where teams can ideate plans, collaborate on projects, organize workflows, and track progress in a visual, productive, and rewarding way. From brainstorm to planning to execution, Trello manages the big milestones and the day-to-day tasks of working together and getting things done. A brief history of Trello Around the summer of 2010, Fog Creek Software starts doing regular Creek Weeks, internal explorations for potential products. In January 2011, a prototype that hopes to solve some high-level planning issues is pitched. It’s called Trellis. Full time development begins soon after. Around the summer of 2010, Fog Creek Software starts doing regular Creek Weeks, internal explorations for potential products. In January 2011, a prototype that hopes to solve some high-level planning issues is pitched. It’s called Trellis. Full time development begins soon after. After a closed beta, Trello launches at TechCrunch Disrupt in September of 2011 with apps for the web and iPhone. We narrowly avoid names like Cardvark and Planatee and go with the name Trello. After a closed beta, Trello launches at TechCrunch Disrupt in September of 2011 with apps for the web and iPhone. We narrowly avoid names like Cardvark and Planatee and go with the name Trello. In the summer of 2012, Fog Creek co-founder Joel Spolsky’s dog Taco becomes the official Trello spokes-husky. Trello reaches 500,000 members and launches the Trello Android app. In the summer of 2012, Fog Creek co-founder Joel Spolsky’s dog Taco becomes the official Trello spokes-husky. Trello reaches 500,000 members and launches the Trello Android app. Bug fixes and performance improvements. Bug fixes and performance improvements. In July 2014, Trello spins off from Fog Creek and becomes Trello, Inc. naming Fog Creek co-founder Michael Pryor as its CEO. The company raises $10.3 million in a Series A round of funding led by Spark Capital and Index Ventures. Trello has over 4.75 million users. In July 2014, Trello spins off from Fog Creek and becomes Trello, Inc. naming Fog Creek co-founder Michael Pryor as its CEO. The company raises $10.3 million in a Series A round of funding led by Spark Capital and Index Ventures. Trello has over 4.75 million users. In May 2015, Trello goes international, with localized experiences for Brazil, Germany, and Spain. In May 2015, Trello goes international, with localized experiences for Brazil, Germany, and Spain. In early 2017, Trello is acquired by Atlassian and begins the next chapter in empowering teams everywhere. In early 2017, Trello is acquired by Atlassian and begins the next chapter in empowering teams everywhere. Help us add more things to this list. Help us add more things to this list. Millions of people and companies of all kinds and sizes love using Trello. Trello in the Press “Trello is an online tool for managing projects and personal tasks. That may sound rather prosaic. But this increasingly popular app often inspires the sort of passion usually reserved for consumer apps like Pinterest or Instagram. It’s the kind of business software that slips into businesses through the backdoor, just because individual employees like how it works.” “It reminds us of the early traction that Dropbox…and other apps up there had that have grabbed individuals and caused them to start using it and bring it to work and convince teams and colleagues to use it and it’s gradually taken over organizations,” said Index Partner Neil Rimer “The visual organizing software has amassed some 4.6 million registered users — now with one million monthly actives — turning their projects, whether household to-do lists or corporate realignment plans, into visual boards using its cloud-based software.” “I’ve been using it for five months now without fail, synthesizing everything from Covey and Allen that stuck, along with Carson and Babauta’s wisdom, to create the only task management system that’s ever really worked for me.” Looking for logos, screenshots, branding guidelines, Taco pics, and other Trello assets? Check out the branding page. Media inquiries? Talk to us at press@atlassian.com. Marketing or content inquiries? Reach us at editor@trello.com.",
  "description": "Trello is the easy, free, flexible, and visual way to manage your projects and organize anything, trusted by millions of people from all over the world.",
  "links": [
    "https://trello.com/about#skip-target"
  ],
  "entities": [],
  "language": "en",
  "content_hash": "3321486dc27f7648aafb9ca7dce1d53bc505ebdd2e6d0aa2ecb6f436aca3468a"
}