{
  "title": "Which Trello Plan Is Best for You? Our Pricing Guide Can Help | Trello",
  "url": "https://trello.com/pricing",
  "published_at": null,
  "updated_at": "2025-11-21T00:41:38.382557",
  "author": null,
  "tags": [
    "true",
    "false",
    "trello",
    "your",
    "more",
    "workspace",
    "boards",
    "premium",
    "unlimited",
    "learn"
  ],
  "content_type": "webpage",
  "word_count": 1611,
  "content": "Trello your way. Trusted by millions, Trello powers teams all around the world.Explore which option is right for you. Free Free for up to 10 collaborators per Workspace Capture your to-dos, get organized, and get sh*t done. Included in Free: Unlimited cards Up to 10 boards per Workspace Quickly capture to-dos from email, Slack, and Teams Inbox Unlimited Power-Ups per board Unlimited storage (10MB/file) 250 Workspace command runs per month Custom backgrounds & stickers Unlimited activity log Assignee and due dates iOS and Android mobile apps 2-factor authentication Standard Per user/month if billed annually ($6 billed monthly) Get more stuff done with unlimited boards, card mirroring, and more automation. Everything in Free, plus: Unlimited boards Quickly capture to-dos from email, Slack, and Teams — powered by AI Planner Advanced checklists Card mirroring Custom Fields List colors Collapsible lists Unlimited storage (250MB/file) 1,000 Workspace command runs per month Single board guests Saved searches Premium Per user/month if billed annually ($12.50 billed monthly) Add AI to your boards and admin controls to your toolkit. Plus, get more perspective with views. Everything in Standard, plus: AI Views: Calendar, Timeline, Table, Dashboard, and Map Workspace views: Table and Calendar Unlimited Workspace command runs Admin and security features Workspace-level templates Collections Observers Simple data export Enterprise Per user/month - billed annually ($210.00 annual price per user) Add enterprise-grade security and controls. This plan includes Atlassian Guard Standard and 24/7 Enterprise Admin support. Everything in Premium, plus: Unlimited Workspaces Organization-wide permissions Organization-visible boards Public board management Multi-board guests Attachment permissions Power-Up administration Free SSO and user provisioning with Atlassian Guard Compare our plans Unlimited cards True True True True Quick capture Instantly capture to-dos, notes, and messages, from email, Slack, and Microsoft Teams. True True True True Inbox Gather messages and to-dos in this personal space before organizing them into your boards. True True True True Planner (view-only) View your scheduled cards on a calendar and synchronize events from your favorite tools. True True True True Quick Capture powered by AI Instantly capture to-dos, notes, and messages from email, Slack, and Microsoft Teams using AI. False True True True Planner (full access) Drag and drop cards on a calendar to block any available time. Sync with more events in your favorite tools. False True True True Card mirroring Keep your to-dos aligned across boards. Mirror a single card to multiple boards to view and edit it from anywhere. False True True True Built-in automation Powerful no-code automation is built into every Trello board. Start automating True True True True Assignee and due dates True True True True iOS and Android mobile apps Download mobile apps True True True True Desktop app Download desktop app True True True True Unlimited activity logs True True True True Trello templates Give your team a blueprint for success with tried-and-true templates from the Trello community. Try a template True True True True 2-factor authentication True True True True Mobile device management Enforce security controls on mobile app usage through built-in mobile device management (MDM) support for iOS and Android. True True True True Unlimited power-ups Integrate with more than 200+ apps and tools your team depends on like Slack, Google Drive, Salesforce, and more directly into your Trello boards. (Note: Some Power-Ups by our partners require an additional subscription fee.) Learn more True True True True Unlimited Workspace collaborators Up to 10 collaborators True True True Unlimited boards Create as many Trello boards as your team sees fit; from onboarding new hires, to sprint planning, and every team meeting agenda in between. False True True True Advanced checklists Break down projects into byte-sized tasks and get granular by assigning members and due dates to individual tasks. False True True True Custom fields Bring process and formality to your workflow by structuring information on Trello cards to the task at hand with Custom Fields. False True True True Collapsible lists Keep your Trello boards tidy and focus on what matters by easily hiding and revealing list details. Learn more False True True True List colors Brighten up your boards by using list colors to easily spot priorities and keep your to-dos organized and on track. Learn more False True True True AI Enhance Trello card descriptions and comments effortlessly with AI-driven content generation, grammar correction, and brainstorming. Learn more False False True True Dashboard view Trello’s reporting tool lets you access real-time insights and communicate your team’s progress in a visual and meaningful way. Learn more False False True True Map view Plan an offsite, scout new office locations, or manage",
  "description": "Built for teams of any size - even one - Trello has something for everyone. Find out which pricing plan is best for your team with our feature breakdown.",
  "links": [
    "https://trello.com/pricing#skip-target",
    "https://trello.com/standard",
    "https://trello.com/premium",
    "https://trello.com/enterprise",
    "https://trello.com/butler-automation",
    "https://trello.com/platforms",
    "https://trello.com/platforms",
    "https://trello.com/templates",
    "https://trello.com/power-ups",
    "https://trello.com/tour",
    "https://trello.com/views/dashboard",
    "https://trello.com/views/map",
    "https://trello.com/views/timeline",
    "https://trello.com/views/table",
    "https://trello.com/views/calendar",
    "https://trello.com/views/workspace",
    "https://trello.com/views/workspace",
    "https://trello.com/premium",
    "https://trello.com/enterprise#contact",
    "https://trello.com/platforms"
  ],
  "entities": [],
  "language": "en",
  "content_hash": "41867ca1a8529830f21d0baedf2e9a29ce3dc96ec4279895318fe9c6c2cc62bb"
}