{
  "title": "Time tracking and cost reporting - OpenProject",
  "url": "https://www.openproject.org/docs/user-guide/time-and-costs/",
  "published_at": null,
  "updated_at": "2025-11-21T00:40:30.925221",
  "author": null,
  "tags": [
    "openproject",
    "management",
    "guide",
    "learn",
    "your",
    "about",
    "enterprise",
    "time",
    "tracking",
    "does"
  ],
  "content_type": "webpage",
  "word_count": 769,
  "content": "On this page   Time tracking, cost tracking and reporting video tutorial   Frequently asked questions (FAQ)   Does OpenProject provide resource management? Time tracking, cost tracking and reporting video tutorial Frequently asked questions (FAQ)   Does OpenProject provide resource management? Does OpenProject provide resource management? Time tracking and cost reporting Time and costs functionality in OpenProject allows keeping track of the resources, both in terms of labor and budgets. With OpenProject you can always keep control of the time and costs planned for and spent on the projects. Create budgets, log time and costs on specific work packages and create time and cost reports based on your needs. Time tracking, cost tracking and reporting video tutorial Watch this short video to get a first overview about time and cost reporting in OpenProject. Your browser does not support the video tag. Frequently asked questions (FAQ) Does OpenProject provide resource management? Please note that OpenProject currently does not yet support resource management. However, this is scheduled in our roadmap as one of our main topics. Our use cases provide examples for workarounds to support resource management within OpenProject. Help and feedback Get help Get help Docs feedback Docs feedback Product feedback Product feedback Get more features Get more features Look up project management terms in our dictionary If you need help from the community or want to support others If you are eligible for professional support and have more questions If you find an easily fixable error or need for improvement in the documentation If you would like to suggest bigger updates or improvements to this documentation If you want to contribute to translate this documentation to another language If there’s something you don’t like or understand about this feature If you want to propose a new feature that OpenProject does not offer yet To further help OpenProject to shape and test new features To view OpenProject Enterprise add-ons and pricing If you want to try all Enterprise add-ons in the OpenProject Enterprise cloud 14 days for free If you want to try all Enterprise add-ons in your on premise Community installation 14 days for free On this page   Time tracking, cost tracking and reporting video tutorial   Frequently asked questions (FAQ)   Does OpenProject provide resource management? Time tracking, cost tracking and reporting video tutorial Frequently asked questions (FAQ)   Does OpenProject provide resource management? Does OpenProject provide resource management? All User guides Docs Blog Website API Release notes First steps   Getting started Learn about the first steps with OpenProject Getting started Learn about the first steps with OpenProject All features   User guide In-depth guide of all features in OpenProject User guide In-depth guide of all features in OpenProject FAQ General frequently asked questions FAQ General frequently asked questions Use Cases Detailed step-by-step instructions Use Cases Detailed step-by-step instructions Glossary A dictionary of project management terms Glossary A dictionary of project management terms Enterprise edition guide Manage your OpenProject Enterprise edition Enterprise edition guide Manage your OpenProject Enterprise edition Project management guide Learn about project management with OpenProject Project management guide Learn about project management with OpenProject Security & privacy Data protection and information security are of central importance for the OpenProject team. Security & privacy Data protection and information security are of central importance for the OpenProject team. Contributions Guide Learn how to contribute to OpenProject Contributions Guide Learn how to contribute to OpenProject System admin guide Learn how to configure your OpenProject System admin guide Learn how to configure your OpenProject Release Notes See the latest changes in OpenProject Release Notes See the latest changes in OpenProject BIM Guide Additional BIM features for construction teams BIM Guide Additional BIM features for construction teams Installation and operations guide Find out how to install and operate OpenProject Installation and operations guide Find out how to install and operate OpenProject Development Learn about how to contribute to OpenProject Development Learn about how to contribute to OpenProject API Learn about the API powering OpenProject API Learn about the API powering OpenProject Most popular topics Installing OpenProject Learn how to download and install OpenProject on your own servers. Installing OpenProject Learn how to download and install OpenProject on your own servers. Enterprise add-ons Find out about the OpenProject Enterprise add-ons to boost your project management. Enterprise add-ons Find out about the OpenProject Enterprise add-ons to boost your project management. OpenProject hosting Get started easily with OpenProject hosting from the experts. OpenProject ",
  "description": "Time tracking and cost reporting in OpenProject.",
  "links": [
    "https://www.openproject.org/docs/user-guide/time-and-costs/#time-tracking-and-cost-reporting",
    "https://www.openproject.org/docs/user-guide/time-and-costs/#time-tracking-cost-tracking-and-reporting-video-tutorial",
    "https://www.openproject.org/docs/user-guide/time-and-costs/#frequently-asked-questions-faq",
    "https://www.openproject.org/docs/user-guide/time-and-costs/#does-openproject-provide-resource-management",
    "https://www.openproject.org/docs/user-guide/time-and-costs/#time-tracking-and-cost-reporting",
    "https://www.openproject.org/docs/user-guide/time-and-costs/progress-tracking",
    "https://www.openproject.org/docs/user-guide/time-and-costs/time-tracking",
    "https://www.openproject.org/docs/user-guide/time-and-costs/my-time-tracking",
    "https://www.openproject.org/docs/user-guide/time-and-costs/cost-tracking",
    "https://www.openproject.org/docs/user-guide/time-and-costs/reporting",
    "https://www.openproject.org/docs/user-guide/time-and-costs/#time-tracking-cost-tracking-and-reporting-video-tutorial",
    "https://www.openproject.org/docs/user-guide/time-and-costs/#frequently-asked-questions-faq",
    "https://www.openproject.org/docs/user-guide/time-and-costs/#does-openproject-provide-resource-management",
    "https://www.openproject.org/docs/use-cases/resource-management",
    "https://www.openproject.org/docs/user-guide/time-and-costs/#help-and-feedback",
    "https://www.openproject.org/docs/user-guide/time-and-costs/#get-help",
    "https://www.openproject.org/docs/user-guide/time-and-costs/#docs-feedback",
    "https://www.openproject.org/docs/user-guide/time-and-costs/#product-feedback",
    "https://www.openproject.org/docs/user-guide/time-and-costs/#get-more-features",
    "https://www.openproject.org/docs/glossary/"
  ],
  "entities": [],
  "language": "en",
  "content_hash": "706851bfc27b1e2a219e9e176a33206c578f40d21685ed8f7e2002c4920b1071"
}