{
  "title": "Frequently asked questions (FAQ) for OpenProject - OpenProject",
  "url": "https://www.openproject.org/docs/faq/",
  "published_at": null,
  "updated_at": "2025-11-28T16:22:07.164845",
  "author": null,
  "tags": [
    "openproject",
    "enterprise",
    "from",
    "edition",
    "premises",
    "with",
    "migrate",
    "cloud",
    "users",
    "there"
  ],
  "content_type": "webpage",
  "word_count": 7165,
  "content": "On this page   Learn more about OpenProject   How do I get access to the OpenProject Enterprise add-ons?   Can I have some users with Enterprise add-ons and some without?   What are the system requirements?   Does OpenProject provide software releases with Long Term Support (LTS)?   How can I learn more about OpenProject?   Can I run OpenProject as a single user?   OpenProject is Open Source. Which kind of license does it come with? What am I allowed to do? What can I change?   Is OpenProject free of charge?   Can I have both users with the Enterprise cloud and others with the Enterprise on-premises edition?   How are users in OpenProject counted? How many licenses do I need for Enterprise on-premises or Enterprise cloud?   How many projects can I manage in OpenProject at once?   What is the difference between Enterprise on-premises and Community edition regarding LDAP?     How to ... in OpenProject   I cannot log in, I do not know my password. What can I do?   I cannot log in. Resetting my password seems to have no effect. What do I do?   How can I reverse changes?   How can I increase or decrease the number of users in OpenProject?   How can I change the day my week starts with, etc.?   How can I add a RACI matrix in OpenProject?   How can I create a PDF file with an individual and consolidated projects report?   How can I receive the OpenProject newsletter?     FAQ regarding features   Is it possible to use multiple languages in OpenProject?   Is there an OpenProject app?   Is it possible to connect MS Project and OpenProject or to migrate from MS Project to OpenProject?   Are there plan/actual comparisons in OpenProject?   Can I use OpenProject offline?   Can I import tasks from spreadsheets like Excel or LibreOffice?   Does OpenProject have guest accounts?   Can I get a notification when a deadline approaches?   Does OpenProject offer resource management?   Does OpenProject offer portfolio management?   Is there an organizational chart in OpenProject?   Is there an architecture diagram for OpenProject?   Can I set up an entity-relationship diagram in OpenProject?   Can I edit the Home page?     FAQ regarding OpenProject BIM edition   How can I find out more about OpenProject BIM edition?   Which IFC format are you using for conversion in the BIM module?   Is there a way to use OpenProject BIM for free, too?   Can a BCF file created from other software e.g. BIMcollab, Solibri, etc. be opened in OpenProject?   Does clicking on a BCF-issue zoom you to the appropriate location in the model?   Can I add photos from my mobile/phone to BIM issues?   Can I use IFC while a Revit connection is not available?     Migration   How can I migrate from Bitnami to OpenProject?   How can I migrate from JIRA/Confluence to OpenProject?   How can I migrate from Community edition or Enterprise on-premises to Enterprise cloud?   How can I migrate from Enterprise cloud to Enterprise on-premises?   How can I migrate from Community edition to Enterprise on-premises?   How can I migrate from Enterprise on-premises to Community edition?   How can I migrate from an old version of OpenProject to the latest version?     Other   How can I contribute to OpenProject?   How can I receive support?   Do you have a cyber insurance?   Is there a limitation of participants for the trainings?   Can trainings be conducted remotely, too (e.g. the Custom training)?   How long is the OpenProject certification valid?   Where can I find out more about pricing?     Topic-specific FAQ Learn more about OpenProject   How do I get access to the OpenProject Enterprise add-ons?   Can I have some users with Enterprise add-ons and some without?   What are the system requirements?   Does OpenProject provide software releases with Long Term Support (LTS)?   How can I learn more about OpenProject?   Can I run OpenProject as a single user?   OpenProject is Open Source. Which kind of license does it come with? What am I allowed to do? What can I change?   Is OpenProject free of charge?   Can I have both users with the Enterprise cloud and others with the Enterprise on-premises edition?   How are users in OpenProject counted? How many licenses do I need for Enterprise on-premises or Enterprise cloud?   How many projects can I manage in OpenProject at once?   What is the difference between Enterprise on-premises and Community edition regarding LDAP? How do I get access to the OpenProject Enterprise add-ons? Can I have some users with Enterprise add-ons and some without? What are the system requirements? Does OpenProject provide software releases with Long Term Support (LTS)? How can I learn more about OpenProject? Can I run OpenProject as a single user? OpenProject is Open Source. Which kind of license does it come with? What am I allowed to do? What can I change? Is OpenProject free of charge? Can I have both users with the Enterprise cloud and others with the Enterprise on-premises edition? How are users in OpenProject counted? How many licenses do I need for En",
  "description": "Frequently asked questions for OpenProject (FAQ)",
  "links": [
    "https://www.openproject.org/docs/faq/#frequently-asked-questions-faq-for-openproject",
    "https://www.openproject.org/docs/faq/#learn-more-about-openproject",
    "https://www.openproject.org/docs/faq/#how-do-i-get-access-to-the-openproject-enterprise-add-ons",
    "https://www.openproject.org/docs/faq/#can-i-have-some-users-with-enterprise-add-ons-and-some-without",
    "https://www.openproject.org/docs/faq/#what-are-the-system-requirements",
    "https://www.openproject.org/docs/faq/#does-openproject-provide-software-releases-with-long-term-support-lts",
    "https://www.openproject.org/docs/faq/#how-can-i-learn-more-about-openproject",
    "https://www.openproject.org/docs/faq/#can-i-run-openproject-as-a-single-user",
    "https://www.openproject.org/docs/faq/#openproject-is-open-source-which-kind-of-license-does-it-come-with-what-am-i-allowed-to-do-what-can-i-change",
    "https://www.openproject.org/docs/faq/#is-openproject-free-of-charge",
    "https://www.openproject.org/docs/faq/#can-i-have-both-users-with-the-enterprise-cloud-and-others-with-the-enterprise-on-premises-edition",
    "https://www.openproject.org/docs/faq/#how-are-users-in-openproject-counted-how-many-licenses-do-i-need-for-enterprise-on-premises-or-enterprise-cloud",
    "https://www.openproject.org/docs/faq/#how-many-projects-can-i-manage-in-openproject-at-once",
    "https://www.openproject.org/docs/faq/#what-is-the-difference-between-enterprise-on-premises-and-community-edition-regarding-ldap",
    "https://www.openproject.org/docs/faq/#how-to--in-openproject",
    "https://www.openproject.org/docs/faq/#i-cannot-log-in-i-do-not-know-my-password-what-can-i-do",
    "https://www.openproject.org/docs/faq/#i-cannot-log-in-resetting-my-password-seems-to-have-no-effect-what-do-i-do",
    "https://www.openproject.org/docs/faq/#how-can-i-reverse-changes",
    "https://www.openproject.org/docs/faq/#how-can-i-increase-or-decrease-the-number-of-users-in-openproject",
    "https://www.openproject.org/docs/faq/#how-can-i-change-the-day-my-week-starts-with-etc"
  ],
  "entities": [],
  "language": "en",
  "content_hash": "386b7971e1fb05a880fff60464e349b38acd266a1c55f690abd2db970d2314d3"
}