{
  "title": "Legal information - OpenProject",
  "url": "https://www.openproject.org/legal/",
  "published_at": null,
  "updated_at": "2025-11-28T15:39:49.917787",
  "author": null,
  "tags": [
    "openproject",
    "guide",
    "learn",
    "data",
    "your",
    "enterprise",
    "about",
    "service",
    "security",
    "terms"
  ],
  "content_type": "webpage",
  "word_count": 765,
  "content": "Legal information Data protection and information security are of central importance in our company andare one of the main motives for the development of this open source software. Privacy Policy  The Privacy Policy explains how we handle your personal data as either a visitor to our websites or as a customer.   View Policy Privacy Policy The Privacy Policy explains how we handle your personal data as either a visitor to our websites or as a customer. Terms of Service  With our Terms of Service we aim to give our customers the advantages and freedom of using an open source application and at the same time to ensure the continuous development of the software in an active developer community.   View Terms Terms of Service With our Terms of Service we aim to give our customers the advantages and freedom of using an open source application and at the same time to ensure the continuous development of the software in an active developer community. Service Description  The Service Description amends the terms of service of the OpenProject Enterprise cloud and the OpenProject Enterprise on-premises.   View Description Service Description The Service Description amends the terms of service of the OpenProject Enterprise cloud and the OpenProject Enterprise on-premises. Data Processing Agreement  The Data Processing Agreement (DPA) defines our obligations under European privacy law (GDPR).   View DPA Data Processing Agreement The Data Processing Agreement (DPA) defines our obligations under European privacy law (GDPR). Sub-Processors  OpenProject’s list of sub-processors which we may use as part of provisioning our services to you.   View List Sub-Processors OpenProject’s list of sub-processors which we may use as part of provisioning our services to you. Technical and Organizational Data Security Measures  More about our data security measures.   Find out more Technical and Organizational Data Security Measures More about our data security measures. Digital Accessibility Statement  Our commitment for accessibility at OpenProject.   View statement Digital Accessibility Statement Our commitment for accessibility at OpenProject. EVB-IT  A well-established framework for standardizing public IT procurement in Germany.   View EVB-IT EVB-IT A well-established framework for standardizing public IT procurement in Germany. Contributor license agreement (CLA)  If you want to contribute to OpenProject, please make sure to accept our Contributor License Agreement first.   View agreement Contributor license agreement (CLA) If you want to contribute to OpenProject, please make sure to accept our Contributor License Agreement first. All User guides Docs Blog Website API Release notes First steps   Getting started Learn about the first steps with OpenProject Getting started Learn about the first steps with OpenProject All features   User guide In-depth guide of all features in OpenProject User guide In-depth guide of all features in OpenProject FAQ General frequently asked questions FAQ General frequently asked questions Use Cases Detailed step-by-step instructions Use Cases Detailed step-by-step instructions Glossary A dictionary of project management terms Glossary A dictionary of project management terms Enterprise edition guide Manage your OpenProject Enterprise edition Enterprise edition guide Manage your OpenProject Enterprise edition Project management guide Learn about project management with OpenProject Project management guide Learn about project management with OpenProject Security & privacy Data protection and information security are of central importance for the OpenProject team. Security & privacy Data protection and information security are of central importance for the OpenProject team. Contributions Guide Learn how to contribute to OpenProject Contributions Guide Learn how to contribute to OpenProject System admin guide Learn how to configure your OpenProject System admin guide Learn how to configure your OpenProject Release Notes See the latest changes in OpenProject Release Notes See the latest changes in OpenProject BIM Guide Additional BIM features for construction teams BIM Guide Additional BIM features for construction teams Installation and operations guide Find out how to install and operate OpenProject Installation and operations guide Find out how to install and operate OpenProject Development Learn about how to contribute to OpenProject Development Learn about how to contribute to OpenProject API Learn about the API powering OpenProject API Learn about the API powering OpenProject Most popular topics Installing OpenProject Learn how to download and install OpenProject on your own servers. Installing OpenProject Learn how to download and install OpenProject on your own servers. Enterprise add-ons Find out about the OpenProject Enterprise add-ons to boost your project management. Enterprise add-ons Find out about the OpenProject Enterprise add-ons to boost your project management. OpenProject hosting Ge",
  "description": "Open source project management software for classic, agile or hybrid project management: task management✓ Gantt charts✓ boards✓ team collaboration✓ time and cost reporting✓ FREE trial!",
  "links": [
    "https://www.openproject.org/legal/privacy/",
    "https://www.openproject.org/legal/terms-of-service/",
    "https://www.openproject.org/legal/terms-of-service",
    "https://www.openproject.org/enterprise-edition/",
    "https://www.openproject.org/legal/description-of-services/",
    "https://www.openproject.org/legal/data-processing-agreement/",
    "https://www.openproject.org/legal/data-processing-agreement/sub-processors/",
    "https://www.openproject.org/legal/data-processing-agreement/technical-and-organizational-data-security-measures/",
    "https://www.openproject.org/legal/digital-accessibility-statement/",
    "https://www.openproject.org/legal/evb-it/",
    "https://www.openproject.org/legal/contributor-license-agreement/",
    "https://www.openproject.org/docs/getting-started/",
    "https://www.openproject.org/docs/user-guide/",
    "https://www.openproject.org/docs/faq/",
    "https://www.openproject.org/docs/use-cases/",
    "https://www.openproject.org/docs/glossary/",
    "https://www.openproject.org/docs/enterprise-guide/",
    "https://www.openproject.org/docs/project-management-guide",
    "https://www.openproject.org/docs/security-and-privacy/",
    "https://www.openproject.org/docs/contributions-guide/"
  ],
  "entities": [],
  "language": "en",
  "content_hash": "9e75be6f9e9d7bb9f4c50907f108af7ddbec6968bb35b29921d30fec67771676"
}