{
  "title": "Documents - OpenProject",
  "url": "https://www.openproject.org/docs/user-guide/documents/",
  "published_at": null,
  "updated_at": "2025-11-28T16:21:54.415825",
  "author": null,
  "tags": [
    "openproject",
    "document",
    "project",
    "documents",
    "enterprise",
    "guide",
    "your",
    "learn",
    "edition",
    "about"
  ],
  "content_type": "webpage",
  "word_count": 1144,
  "content": "On this page   Document index   View a document   Add a new document to the project   Edit or delete a project document   Frequently asked questions (FAQ)   Is there a size limit for uploading documents to the OpenProject Enterprise cloud edition? Document index View a document Add a new document to the project Edit or delete a project document Frequently asked questions (FAQ)   Is there a size limit for uploading documents to the OpenProject Enterprise cloud edition? Is there a size limit for uploading documents to the OpenProject Enterprise cloud edition? Documents The Documents module allows you to write or upload documents directly to the project. Note Please note that this module only allows you to manually write or upload documents directly to a project. For more advanced functionalities, please take a look at the file storages integrations. Document index To use the Documents module, make sure it is enabled in the Project settings of your project (Project settings → Modules). Once it is enabled, you can navigate to the Documents module in the sidebar of your project to get to the Documents index that lists all available documents: The Documents index page lets you: View all documents Filter by document type Quick-filter the list of documents based on the document title Add a new document View a list of all available documents, including their type and the date they were last edited A document in OpenProject can be: a text written directly in the editor of a document a file uploaded and attached to a document both a file uploaded and attached to a document, with a text note that describes it View a document To view a document, simply click on the name of a document in the index. You will then see the document: A document has: A title, a category and creation date Edit and delete buttons The description of the document (or the document text itself) Attachments Add a new document to the project To create a new document, click on the + Document button. In the form that appears, select the document category, give it a title and an optional description. You can optionally also attach a file to the document. Please note that that these document categories are created by the administrator of your instance. The uploaded documents are visible to all project members who have the necessary permissions. Note There is no versioning of documents. An edit of any field or the contents of the document is visible to all members. Edit or delete a project document You can edit or delete documents anytime. To do that, click on the Edit button when viewing a document. This will take you to edit view: Frequently asked questions (FAQ) Is there a size limit for uploading documents to the OpenProject Enterprise cloud edition? There is no limit in OpenProject in terms of the number of files that you can upload and work with in OpenProject. There is only a restriction in terms of the maximum file size: A file can have a size up to 256 MB. Help and feedback Get help Get help Docs feedback Docs feedback Product feedback Product feedback Get more features Get more features Look up project management terms in our dictionary If you need help from the community or want to support others If you are eligible for professional support and have more questions If you find an easily fixable error or need for improvement in the documentation If you would like to suggest bigger updates or improvements to this documentation If you want to contribute to translate this documentation to another language If there’s something you don’t like or understand about this feature If you want to propose a new feature that OpenProject does not offer yet To further help OpenProject to shape and test new features To view OpenProject Enterprise add-ons and pricing If you want to try all Enterprise add-ons in the OpenProject Enterprise cloud 14 days for free If you want to try all Enterprise add-ons in your on premise Community installation 14 days for free On this page   Document index   View a document   Add a new document to the project   Edit or delete a project document   Frequently asked questions (FAQ)   Is there a size limit for uploading documents to the OpenProject Enterprise cloud edition? Document index View a document Add a new document to the project Edit or delete a project document Frequently asked questions (FAQ)   Is there a size limit for uploading documents to the OpenProject Enterprise cloud edition? Is there a size limit for uploading documents to the OpenProject Enterprise cloud edition? All User guides Docs Blog Website API Release notes First steps   Getting started Learn about the first steps with OpenProject Getting started Learn about the first steps with OpenProject All features   User guide In-depth guide of all features in OpenProject User guide In-depth guide of all features in OpenProject FAQ General frequently asked questions FAQ General frequently asked questions Use Cases Detailed step-by-step instructions Use Cases Deta",
  "description": "Create documents and attach files in OpenProject.",
  "links": [
    "https://www.openproject.org/docs/user-guide/documents/#documents",
    "https://www.openproject.org/docs/user-guide/documents/#document-index",
    "https://www.openproject.org/docs/user-guide/documents/#view-a-document",
    "https://www.openproject.org/docs/user-guide/documents/#add-a-new-document-to-the-project",
    "https://www.openproject.org/docs/user-guide/documents/#edit-or-delete-a-project-document",
    "https://www.openproject.org/docs/user-guide/documents/#frequently-asked-questions-faq",
    "https://www.openproject.org/docs/user-guide/documents/#is-there-a-size-limit-for-uploading-documents-to-the-openproject-enterprise-cloud-edition",
    "https://www.openproject.org/docs/user-guide/documents/#documents",
    "https://www.openproject.org/docs/user-guide/file-management",
    "https://www.openproject.org/docs/user-guide/documents/#document-index",
    "https://www.openproject.org/docs/user-guide/documents/#view-a-document",
    "https://www.openproject.org/docs/user-guide/documents/#add-a-new-document-to-the-project",
    "https://www.openproject.org/docs/user-guide/documents/#edit-or-delete-a-project-document",
    "https://www.openproject.org/docs/user-guide/documents/#frequently-asked-questions-faq",
    "https://www.openproject.org/docs/user-guide/documents/#is-there-a-size-limit-for-uploading-documents-to-the-openproject-enterprise-cloud-edition",
    "https://www.openproject.org/docs/user-guide/documents/#help-and-feedback",
    "https://www.openproject.org/docs/user-guide/documents/#get-help",
    "https://www.openproject.org/docs/user-guide/documents/#docs-feedback",
    "https://www.openproject.org/docs/user-guide/documents/#product-feedback",
    "https://www.openproject.org/docs/user-guide/documents/#get-more-features"
  ],
  "entities": [],
  "language": "en",
  "content_hash": "5e403f77c9b2bfc8602dfafceba33cdd192b4b611a683e288d8670e4b0cc3609"
}