{
  "title": "Meeting management - OpenProject",
  "url": "https://www.openproject.org/docs/user-guide/meetings/",
  "published_at": null,
  "updated_at": "2025-11-28T15:39:28.017576",
  "author": null,
  "tags": [
    "meetings",
    "openproject",
    "project",
    "guide",
    "lists",
    "meeting",
    "specific",
    "learn",
    "your",
    "user"
  ],
  "content_type": "webpage",
  "word_count": 1220,
  "content": "On this page   Meetings in OpenProject   Meetings overview   Meetings filters Meetings in OpenProject   Meetings overview   Meetings filters Meetings overview Meetings filters Meeting management Meetings in OpenProject allow you to manage and document your project meetings, prepare a meeting agenda together with your team, and share minutes with attendees - all in one central place. Meetings is defined as a module that allows the organization of meetings. Note: In order to be able to use the meetings plugin, the Meetings module needs to be activated in the Project Settings. Important With OpenProject 13.1 we introduced dynamic meetings alongside classic meetings. With OpenProject 15.3 dynamic meetings are replaced by one-time meetings and recurring meetings to further improve meeting management. With OpenProject 16.0 classic meetings were removed from OpenProject. Meetings in OpenProject Meetings in OpenProject help teams organize discussions, track meeting agendas, and document decisions efficiently. There are two types of meetings: one-time meetings and recurring meetings. One-time meetings are standalone events scheduled for a specific date and time. Recurring meetings introduce a structured way to define a series of related meetings, ensuring consistency and reducing manual setup. Meetings overview By selecting Meetings in the project menu on the left, you get an overview of all the meetings you have been invited to within a specific project sorted by date. By clicking on a meeting name you can view further details of the meeting. To get an overview of the meetings across multiple projects, you can select Meetings in the global modules menu. Meetings will be grouped based on the meeting start time into the following groups: Today lists open meetings scheduled for the same day Today lists open meetings scheduled for the same day Tomorrow lists open meetings scheduled for the day after Tomorrow lists open meetings scheduled for the day after Later this week lists all open meetings scheduled between two days from now till the end of the week Later this week lists all open meetings scheduled between two days from now till the end of the week Next week and later lists all open meetings scheduled the next week and later Next week and later lists all open meetings scheduled the next week and later Meetings filters The menu on the left will allow you to filter meetings based on following: My meetings lists all meetings you participate in Recurring meetings lists all recurring meetings visible to you All meetings lists all meetings visible to you Meeting series lists meeting occurrences that are part of recurring meetings Invitations lists all meetings you are invited to Attended lists all meetings in which you were marked as having attended Created by me lists all meetings created by you The buttons next to Filters will allow you to filter for upcoming or past meetings. You can also use the meetings filters to refine the list of meetings based on the following criteria: Attended user - shows meetings that a specific user attended Attended user - shows meetings that a specific user attended Author - shows meetings that a specific user created Author - shows meetings that a specific user created Invited user - shows meetings that a specific user was invited to Invited user - shows meetings that a specific user was invited to Part of a meeting series - shows meetings that are part of specific meeting series Part of a meeting series - shows meetings that are part of specific meeting series Project - shows meetings for a specific project (this will only be displayed in the global module view, i.e. not within a specific project) Project - shows meetings for a specific project (this will only be displayed in the global module view, i.e. not within a specific project) Tip If you are interested in how the Meetings module is used by the OpenProject team, please take a look at this blog article. Find out more about OpenProject as open source meeting management software. Help and feedback Get help Get help Docs feedback Docs feedback Product feedback Product feedback Get more features Get more features Look up project management terms in our dictionary If you need help from the community or want to support others If you are eligible for professional support and have more questions If you find an easily fixable error or need for improvement in the documentation If you would like to suggest bigger updates or improvements to this documentation If you want to contribute to translate this documentation to another language If there’s something you don’t like or understand about this feature If you want to propose a new feature that OpenProject does not offer yet To further help OpenProject to shape and test new features To view OpenProject Enterprise add-ons and pricing If you want to try all Enterprise add-ons in the OpenProject Enterprise cloud 14 days for free If you want to try all Enterprise add-ons in your on premise C",
  "description": "Manage meetings with agenda and meeting minutes in OpenProject.",
  "links": [
    "https://www.openproject.org/docs/user-guide/meetings/#meeting-management",
    "https://www.openproject.org/docs/user-guide/meetings/#meetings-in-openproject",
    "https://www.openproject.org/docs/user-guide/meetings/#meetings-overview",
    "https://www.openproject.org/docs/user-guide/meetings/#meetings-filters",
    "https://www.openproject.org/docs/user-guide/meetings/#meeting-management",
    "https://www.openproject.org/docs/user-guide/projects/project-settings/modules",
    "https://www.openproject.org/docs/user-guide/meetings/one-time-meetings",
    "https://www.openproject.org/docs/user-guide/meetings/recurring-meetings",
    "https://www.openproject.org/docs/user-guide/meetings/#meetings-in-openproject",
    "https://www.openproject.org/docs/user-guide/meetings/one-time-meetings",
    "https://www.openproject.org/docs/user-guide/meetings/recurring-meetings",
    "https://www.openproject.org/docs/user-guide/meetings/meetings-faq",
    "https://www.openproject.org/docs/user-guide/meetings/#meetings-in-openproject",
    "https://www.openproject.org/docs/user-guide/meetings/one-time-meetings",
    "https://www.openproject.org/docs/user-guide/meetings/recurring-meetings",
    "https://www.openproject.org/docs/user-guide/meetings/#meetings-overview",
    "https://www.openproject.org/docs/user-guide/home/global-modules",
    "https://www.openproject.org/docs/user-guide/meetings/#meetings-filters",
    "https://www.openproject.org/blog/meeting-management-example/",
    "https://www.openproject.org/collaboration-software-features/meeting-management/"
  ],
  "entities": [],
  "language": "en",
  "content_hash": "ab4ee16e5b315afd55dcd1a00772872b2931774c55da43f1abc3b605f18d9e97"
}