{
  "title": "Gantt charts - OpenProject",
  "url": "https://www.openproject.org/docs/user-guide/gantt-chart/",
  "published_at": null,
  "updated_at": "2025-11-21T00:40:27.677728",
  "author": null,
  "tags": [
    "gantt",
    "chart",
    "work",
    "openproject",
    "package",
    "project",
    "view",
    "your",
    "zoom",
    "export"
  ],
  "content_type": "webpage",
  "word_count": 3218,
  "content": "On this page   Activate the Gantt chart   Gantt chart views   Quick context menu in Gantt chart view   Create a new element in the Gantt chart   How to change the duration of an element in the Gantt chart     Relations in the Gantt chart   Understanding the colors and lines in the Gantt chart   Gantt chart configuration   How to export data from a Gantt diagram   How to print a Gantt chart   Gantt chart PDF Export (Enterprise add-on)     Gantt chart views   Zoom in the Gantt chart   Auto zoom   Zen mode     Multi project views   Aggregation by project Activate the Gantt chart Gantt chart views Quick context menu in Gantt chart view Create a new element in the Gantt chart   How to change the duration of an element in the Gantt chart How to change the duration of an element in the Gantt chart Relations in the Gantt chart Understanding the colors and lines in the Gantt chart Gantt chart configuration   How to export data from a Gantt diagram   How to print a Gantt chart   Gantt chart PDF Export (Enterprise add-on) How to export data from a Gantt diagram How to print a Gantt chart Gantt chart PDF Export (Enterprise add-on) Gantt chart views   Zoom in the Gantt chart   Auto zoom   Zen mode Zoom in the Gantt chart Auto zoom Zen mode Multi project views Aggregation by project Gantt charts The Gantt charts module in OpenProject displays the work packages in a timeline. You can collaboratively create and manage your project plan, have your project timelines available to all team members, and share up-to-date information with stakeholders. You can add start and finish dates and adapt them via drag and drop directly in the Gantt chart. Also, you can add dependencies, predecessors, or followers within the Gantt chart. Your browser does not support the video tag. Activate the Gantt chart A Gantt chart view can be activated either for a specific project or on the project overarching level if you need to view the timeline for multiple projects. For a specific project, select the Gantt charts module from the project module menu on the left side. To view multiple projects in a single timeline, select Gantt charts from the Global Modules menu. Alternatively, you can also use the Include projects filter. Gantt chart views Once you open the Gantt charts module, the default view will show all open work packages. You can search for a specific Gantt chart using the search bar on the left. You can adjust the view using the filters or select one of the following view options: Favorite: lists all saved Gantt chart views that are marked as favorite Default: lists pre-defined Gantt chart views and includes the following: All open: shows all work packages with the status open Milestones: shows all work packages with the work package type Milestones (or other types that are set to be recognized as milestones) Public: lists all Gantt chart views set to be public Private: lists all your personal saved Gantt chart views Quick context menu in Gantt chart view Once you have selected the Gantt chart view, you can use the quick context menu. To do that, right-click on any of the work packages. Tip If you use the work packages view in the Work packages module, the options in the quick context menu will differ slightly from the ones in the Gantt chart view. You can use any of the following options. Open details view - opens the details view of a work package on the right side of the screen. Open fullscreen view - opens the detailed view of a work package across the entire screen. Copy link to clipboard - copies a short link to the selected work package to your clipboard. Change project - allows moving the selected work package to a different project. Delete - deletes a work package. You will need to confirm the deletion. Indent hierarchy - creates a child-parent relationship with the work package directly above. The work package you selected becomes the child work package. The work package directly above becomes the parent work package. Add predecessor - adds a predecessor (it will prompt you to select a work package in Gantt view). Add successor - adds a successor (it will prompt you to select a work package in Gantt view). Show relations - opens the details view of a work package and displays the Relations tab. Create new child - opens a new work package on the right side of the screen. This new work package already has a child relationship to the work package you selected. This option will not be available if the work package type is a milestone. Create a new element in the Gantt chart To add a work package (e.g. phase, milestone or task) to a Gantt chart, click the + Create new work package link at the bottom of the work package table view. You can add a subject and make changes to type, status or more fields. In the Gantt chart, you can schedule the work package with drag and drop and change the duration. To change the order of an item in the Gantt chart, click the drag and drop icon (6 dots) on the left-hand side of the work package row. D",
  "description": "Create project timelines with Gantt charts in OpenProject",
  "links": [
    "https://www.openproject.org/docs/user-guide/gantt-chart/#gantt-charts",
    "https://www.openproject.org/docs/user-guide/gantt-chart/#activate-the-gantt-chart",
    "https://www.openproject.org/docs/user-guide/gantt-chart/#gantt-chart-views",
    "https://www.openproject.org/docs/user-guide/gantt-chart/#quick-context-menu-in-gantt-chart-view",
    "https://www.openproject.org/docs/user-guide/gantt-chart/#create-a-new-element-in-the-gantt-chart",
    "https://www.openproject.org/docs/user-guide/gantt-chart/#how-to-change-the-duration-of-an-element-in-the-gantt-chart",
    "https://www.openproject.org/docs/user-guide/gantt-chart/#relations-in-the-gantt-chart",
    "https://www.openproject.org/docs/user-guide/gantt-chart/#understanding-the-colors-and-lines-in-the-gantt-chart",
    "https://www.openproject.org/docs/user-guide/gantt-chart/#gantt-chart-configuration",
    "https://www.openproject.org/docs/user-guide/gantt-chart/#how-to-export-data-from-a-gantt-diagram",
    "https://www.openproject.org/docs/user-guide/gantt-chart/#how-to-print-a-gantt-chart",
    "https://www.openproject.org/docs/user-guide/gantt-chart/#gantt-chart-pdf-export-enterprise-add-on",
    "https://www.openproject.org/docs/user-guide/gantt-chart/#gantt-chart-views-1",
    "https://www.openproject.org/docs/user-guide/gantt-chart/#zoom-in-the-gantt-chart",
    "https://www.openproject.org/docs/user-guide/gantt-chart/#auto-zoom",
    "https://www.openproject.org/docs/user-guide/gantt-chart/#zen-mode",
    "https://www.openproject.org/docs/user-guide/gantt-chart/#multi-project-views",
    "https://www.openproject.org/docs/user-guide/gantt-chart/#aggregation-by-project",
    "https://www.openproject.org/docs/user-guide/gantt-chart/#gantt-charts",
    "https://www.openproject.org/docs/user-guide/gantt-chart/#activate-the-gantt-chart"
  ],
  "entities": [],
  "language": "en",
  "content_hash": "0416d572ec63aefdd4ef1f03968b10996b561e15c36b4b2bf14f351d34a299f2"
}