{
  "title": "Work packages - OpenProject",
  "url": "https://www.openproject.org/docs/user-guide/work-packages/",
  "published_at": null,
  "updated_at": "2025-11-28T15:39:44.821909",
  "author": null,
  "tags": [
    "openproject",
    "guide",
    "learn",
    "project",
    "work",
    "your",
    "enterprise",
    "about",
    "features",
    "management"
  ],
  "content_type": "webpage",
  "word_count": 724,
  "content": "On this page   Overview Overview Work packages Work packages are items in a project (such as tasks, features, risks, user stories, bugs, change requests). A work package captures important information and can be assigned to project members for execution. Work packages have a type, an ID, a subject and may have various additional attributes, such as status, assignee, priority, due date. Work package ID is defined as a unique integer assigned to a newly created work package. Work package IDs cannot be changed and are numbered across all projects of an OpenProject instance (therefore, the numbering within a project may not be sequential). Types are the different items a work package can represent, such as task, feature, bug, phase, milestone. The work package types can be configured in the system administration. Work packages can be displayed in a projects timeline, e.g. as a milestone or a phase. In order to use the work packages, the work package module has to be activated in the project settings. Overview Your browser does not support the video tag. Help and feedback Get help Get help Docs feedback Docs feedback Product feedback Product feedback Get more features Get more features Look up project management terms in our dictionary If you need help from the community or want to support others If you are eligible for professional support and have more questions If you find an easily fixable error or need for improvement in the documentation If you would like to suggest bigger updates or improvements to this documentation If you want to contribute to translate this documentation to another language If there’s something you don’t like or understand about this feature If you want to propose a new feature that OpenProject does not offer yet To further help OpenProject to shape and test new features To view OpenProject Enterprise add-ons and pricing If you want to try all Enterprise add-ons in the OpenProject Enterprise cloud 14 days for free If you want to try all Enterprise add-ons in your on premise Community installation 14 days for free On this page   Overview Overview All User guides Docs Blog Website API Release notes First steps   Getting started Learn about the first steps with OpenProject Getting started Learn about the first steps with OpenProject All features   User guide In-depth guide of all features in OpenProject User guide In-depth guide of all features in OpenProject FAQ General frequently asked questions FAQ General frequently asked questions Use Cases Detailed step-by-step instructions Use Cases Detailed step-by-step instructions Glossary A dictionary of project management terms Glossary A dictionary of project management terms Enterprise edition guide Manage your OpenProject Enterprise edition Enterprise edition guide Manage your OpenProject Enterprise edition Project management guide Learn about project management with OpenProject Project management guide Learn about project management with OpenProject Security & privacy Data protection and information security are of central importance for the OpenProject team. Security & privacy Data protection and information security are of central importance for the OpenProject team. Contributions Guide Learn how to contribute to OpenProject Contributions Guide Learn how to contribute to OpenProject System admin guide Learn how to configure your OpenProject System admin guide Learn how to configure your OpenProject Release Notes See the latest changes in OpenProject Release Notes See the latest changes in OpenProject BIM Guide Additional BIM features for construction teams BIM Guide Additional BIM features for construction teams Installation and operations guide Find out how to install and operate OpenProject Installation and operations guide Find out how to install and operate OpenProject Development Learn about how to contribute to OpenProject Development Learn about how to contribute to OpenProject API Learn about the API powering OpenProject API Learn about the API powering OpenProject Most popular topics Installing OpenProject Learn how to download and install OpenProject on your own servers. Installing OpenProject Learn how to download and install OpenProject on your own servers. Enterprise add-ons Find out about the OpenProject Enterprise add-ons to boost your project management. Enterprise add-ons Find out about the OpenProject Enterprise add-ons to boost your project management. OpenProject hosting Get started easily with OpenProject hosting from the experts. OpenProject hosting Get started easily with OpenProject hosting from the experts. Support Find out how to get maintenance and support for OpenProject in your organization. Support Find out how to get maintenance and support for OpenProject in your organization.",
  "description": "Find out about work packages in OpenProject",
  "links": [
    "https://www.openproject.org/docs/user-guide/work-packages/#work-packages",
    "https://www.openproject.org/docs/user-guide/work-packages/#overview",
    "https://www.openproject.org/docs/user-guide/work-packages/#work-packages",
    "https://www.openproject.org/docs/user-guide/work-packages/#overview",
    "https://www.openproject.org/docs/user-guide/work-packages/work-package-views",
    "https://www.openproject.org/docs/user-guide/work-packages/create-work-package",
    "https://www.openproject.org/docs/user-guide/work-packages/set-change-dates",
    "https://www.openproject.org/docs/user-guide/work-packages/baseline-comparison",
    "https://www.openproject.org/docs/user-guide/work-packages/share-work-packages",
    "https://www.openproject.org/docs/user-guide/work-packages/edit-work-package",
    "https://www.openproject.org/docs/user-guide/work-packages/automatic-subjects",
    "https://www.openproject.org/docs/user-guide/work-packages/duplicate-move-delete",
    "https://www.openproject.org/docs/user-guide/work-packages/work-package-table-configuration",
    "https://www.openproject.org/docs/user-guide/work-packages/exporting",
    "https://www.openproject.org/docs/user-guide/work-packages/work-package-relations-hierarchies",
    "https://www.openproject.org/docs/user-guide/work-packages/#help-and-feedback",
    "https://www.openproject.org/docs/user-guide/work-packages/#get-help",
    "https://www.openproject.org/docs/user-guide/work-packages/#docs-feedback",
    "https://www.openproject.org/docs/user-guide/work-packages/#product-feedback",
    "https://www.openproject.org/docs/user-guide/work-packages/#get-more-features"
  ],
  "entities": [],
  "language": "en",
  "content_hash": "6a1d66572cc19a7052fa05a1847afdb5f8243e6befc3c190e06d55303bae49dd"
}