{
  "title": "OpenProject Pricing - from €0. Start your free trial now.",
  "url": "https://www.openproject.org/pricing/",
  "published_at": null,
  "updated_at": "2025-11-21T00:40:50.354076",
  "author": null,
  "tags": [
    "your",
    "openproject",
    "with",
    "support",
    "project",
    "work",
    "enterprise",
    "users",
    "community",
    "learn"
  ],
  "content_type": "webpage",
  "word_count": 2872,
  "content": "Pricing OpenProject is the best open source project management software.Self-managed or in the cloud, we have the perfect plan for every team. The perfect plan for your team Users can be selected in increments of 5. Learn more Choose your hosting preference: on-premises is hosted on your own infrastructure, while the cloud is hosted and maintained by us. Learn more Select a runtime for your subscription. Please note, the 1 month period is available only for Cloud Basic. Learn more On top of the general project management features, OpenProject BIM enables construction teams to better plan, communicate and collaborate in their building projects. Learn more Choose your support and features level. All plans include the Community features and the features of all lower plans. Community Free No minimum users Community features Community support  Community tickets Community forum User guides Community tickets Community forum User guides Basic €5.95 All from Community, plus Basic Enterprise add-ons Basic support  Mon-Fri, 9:30-16:00 CET Mon-Fri, 9:30 am - 4 pm ET  All Community support, plus  Email support Mon-Fri, 9:30-16:00 CET Mon-Fri, 9:30 am - 4 pm ET All Community support, plus Email support Professional €10.95 All from Basic, plus Professional Enterprise add-ons Professional support  Mon-Fri, 9:30-17:00 CET Mon-Fri, 9:30 am - 5 pm ET  All Basic support, plus  Phone support Training material and best practices Onboarding training Mon-Fri, 9:30-17:00 CET Mon-Fri, 9:30 am - 5 pm ET All Basic support, plus Phone support Training material and best practices Onboarding training Premium €15.95 All from Professional, plus Premium Enterprise add-ons Premium support  Mon-Fri, 9:30-17:30 CET Mon-Fri, 9:30 am - 5:30 pm ET  All Professional support, plus  Remote hands Installation and upgrade assistance Dedicated onboarding manager (3h) Mon-Fri, 9:30-17:30 CET Mon-Fri, 9:30 am - 5:30 pm ET All Professional support, plus Remote hands Installation and upgrade assistance Dedicated onboarding manager (3h) Corporate On request All from Premium, plus Corporate Enterprise add-ons OpenID Connect for Nextcloud Hub integration openDesk integration Corporate support  Mon-Fri, 9:00-18:00 CET Mon-Fri, 9 am - 6 pm ET  All Premium support, plus  Custom plugin support Dedicated support engineer Mon-Fri, 9:00-18:00 CET Mon-Fri, 9 am - 6 pm ET All Premium support, plus Custom plugin support Dedicated support engineer Not sure yet? Try OpenProject for free You can test the OpenProject Enterprise cloud 14 days for free, or you can get a 14 days free trial license key to upgrade your self-hosted Community edition to the Enterprise on-premises – risk-free without cancellation. Feature comparison Features per plan A dashboard with important project information that you can customize with widgets and graphs to your needs. Get a clear overview of project timelines across portfolios to easily assess project status and make informed portfolio decisions. Break-down your work in a project: create tasks and subtasks, features, phases and milestones and assign them across your team. Easily create and visualize project plans and timelines and share them with your team and other stakeholders. Set a project baseline and compare changes with yesterday. The full baseline feature, which allows comparisons with any date (range), is part of the Enterprise version. Agile boards help you to organize and prioritize your work with your team. Schedule your work with an automatic scheduling mode and a manual scheduling mode to plan your project top-down without knowing all tasks yet. Define working and non-working days for the scheduling of work packages. Support your Scrum teams and create a product backlog and a task boards, estimate story points, view the burndown chart. Create and share your meeting agenda and meeting minutes and link them directly to work packages. Keep and eye on your deadlines and display the project’s work packages in your calendar. Log your time for the day or week on the work packages and see your time log history. Track and evaluate estimated and spent unit costs or labor costs for your projects. Evaluate your spent time and costs in detailed reports. Plan labour and unit costs for your projects and keep an eye on the status. Create and track bugs based on individual templates and keep track of the status. Create and share project information, e.g. documentation, references, guidelines, user manuals, and more in one central place. Upload and share your documents in a project. Discuss and comment on topics in a project with the team. Add your own custom fields for work packages, spent time, projects, project lists, versions, users, and groups. Define your own custom workflows that your work package is going through. Create and manage groups and configure detailed permissions. Create new work packages types and add default descriptions and input fields. Set up everything that you want to have available for future projects. Your pe",
  "description": "Open source project management software for classic, agile or hybrid project management: task management✓ Gantt charts✓ boards✓ team collaboration✓ time and cost reporting✓ FREE trial!",
  "links": [
    "https://www.openproject.org/pricing/#faq",
    "https://www.openproject.org/pricing/#faq",
    "https://www.openproject.org/pricing/#faq",
    "https://www.openproject.org/pricing/#add-ons",
    "https://www.openproject.org/pricing/#features",
    "https://www.openproject.org/contact/",
    "https://www.openproject.org/docs/user-guide/project-overview/",
    "https://www.openproject.org/docs/user-guide/projects/project-settings/project-life-cycle/",
    "https://www.openproject.org/docs/user-guide/work-packages/",
    "https://www.openproject.org/docs/user-guide/gantt-chart/",
    "https://www.openproject.org/docs/user-guide/work-packages/baseline-comparison/",
    "https://www.openproject.org/docs/user-guide/agile-boards/",
    "https://www.openproject.org/docs/user-guide/gantt-chart/scheduling/",
    "https://www.openproject.org/docs/user-guide/work-packages/set-change-dates/#working-days",
    "https://www.openproject.org/docs/user-guide/backlogs-scrum/",
    "https://www.openproject.org/docs/user-guide/meetings/",
    "https://www.openproject.org/docs/user-guide/calendar/",
    "https://www.openproject.org/docs/user-guide/time-and-costs/time-tracking/",
    "https://www.openproject.org/docs/user-guide/time-and-costs/cost-tracking/",
    "https://www.openproject.org/docs/user-guide/time-and-costs/reporting/"
  ],
  "entities": [],
  "language": "en",
  "content_hash": "afbdfd24b930b83cf01cbb73a45a7158dcf895b4bdcbaf66ab73d180368f550d"
}