{
  "title": "Boards for Agile Project Management - OpenProject",
  "url": "https://www.openproject.org/docs/user-guide/agile-boards/",
  "published_at": null,
  "updated_at": "2025-11-21T00:40:32.642152",
  "author": null,
  "tags": [
    "board",
    "boards",
    "openproject",
    "list",
    "your",
    "work",
    "status",
    "lists",
    "cards",
    "project"
  ],
  "content_type": "webpage",
  "word_count": 2572,
  "content": "On this page   Agile boards in OpenProject   Create a new board   Choose between board types   Basic board (Community edition)   Action boards (Enterprise add-on)   Status board   Assignee board   Version board   Subproject board   Parent-child board     Give the board a title   Add lists to your board   Remove lists   Add cards to a list   Update cards   Remove cards   Manage boards   Agile boards examples   Basic board   Action boards Agile boards in OpenProject Create a new board Choose between board types Basic board (Community edition) Action boards (Enterprise add-on)   Status board   Assignee board   Version board   Subproject board   Parent-child board Status board Assignee board Version board Subproject board Parent-child board Give the board a title Add lists to your board Remove lists Add cards to a list Update cards Remove cards Manage boards Agile boards examples   Basic board   Action boards Basic board Action boards Boards for Agile Project Management Boards support Agile project management methodologies, such as Scrum or Kanban. OpenProject Agile boards enable you to keep track tasks, bugs, features, risks and any other work package types. Boards consist of lists (columns) and cards (work packages). You can choose between a Basic board and various advanced Action boards. Note The Basic board is included in the OpenProject Community edition. OpenProject Action boards are not. Your browser does not support the video tag. Agile boards in OpenProject Boards in OpenProject are closely integrated with all the other project management functionalities, such as work packages and Gantt charts. To get an overview of the project specific boards, navigate to your project and select Boards from the menu on the left. You will see an overview of all the boards that have been created in that specific project until now. You can click on the name of a specific board or use the search bar on the left. You can also view the boards on the instance level via the global modules menu. Create a new board You can create as many Agile boards in a project as you need and configure them to your needs. First, you need to create a new Board. To do that, click on the green +Board button. Note To use this functionality, you need to activate the Boards module within your project. We also recommend to verify Roles and Permissions within your instance administration. Choose between board types Choose the board type and title. Basic board (Community edition) The Basic board is included in the OpenProject Community edition. You can freely create lists, name them and order your work packages within. If you move work packages between the lists, there will be NO changes to the work package itself. This allows you to create flexible boards for any kind of activity you would like to track, e.g. Management of Ideas. Action boards (Enterprise add-on) In an Action board each list represents a value of an attribute of the contained work packages (cards). For example the Status board includes a list for the status “New” and a list for the status “In Progress”. Moving work packages (cards) between two lists will update them automatically, based on the list to which they’re moved. After adding lists to your board they will automatically be filled with the respective work packages. There are several types of Action boards available in OpenProject: Status board Each list represents a status. That means that all work packages with the status “New” will be automatically displayed in the column “New”. When creating a new Status board a list of all work packages in the default status (usually this is the status “New”) will be added automatically, while additional lists need to be added manually. Tip You can not move work packages from or to every status. Please find out more about the workflow rules and restrictions here. Assignee board Every list represents one assignee. You can choose regular users, placeholder users and groups as assignees. When you move a card from one list to another, the assigned user is changed to the user that is selected for the list you moved the card to. Version board Every list represents a version. This board is ideal for product development or planning software releases. When creating a new Version board a list with all work packages in the version(s) belonging to the current project will be added automatically, while additional lists need to be added manually. By moving a card from one list to another, the version for the work package is changed to the version of the corresponding list. Subproject board Every list represents a subproject. Within the list you will find the subproject’s work packages. By moving a card within a list you can change the order of the cards and if you move a card to another list you change the (sub)project of this work package. Parent-child board Every list represents a parent work package. Within the list you will find the work package’s children. Only work packa",
  "description": "How to get started with Agile boards for Kanban, Scrum and Agile Project Management.",
  "links": [
    "https://www.openproject.org/docs/user-guide/agile-boards/#boards-for-agile-project-management",
    "https://www.openproject.org/docs/user-guide/agile-boards/#agile-boards-in-openproject",
    "https://www.openproject.org/docs/user-guide/agile-boards/#create-a-new-board",
    "https://www.openproject.org/docs/user-guide/agile-boards/#choose-between-board-types",
    "https://www.openproject.org/docs/user-guide/agile-boards/#basic-board-community-edition",
    "https://www.openproject.org/docs/user-guide/agile-boards/#action-boards-enterprise-add-on",
    "https://www.openproject.org/docs/user-guide/agile-boards/#status-board",
    "https://www.openproject.org/docs/user-guide/agile-boards/#assignee-board",
    "https://www.openproject.org/docs/user-guide/agile-boards/#version-board",
    "https://www.openproject.org/docs/user-guide/agile-boards/#subproject-board",
    "https://www.openproject.org/docs/user-guide/agile-boards/#parent-child-board",
    "https://www.openproject.org/docs/user-guide/agile-boards/#give-the-board-a-title",
    "https://www.openproject.org/docs/user-guide/agile-boards/#add-lists-to-your-board",
    "https://www.openproject.org/docs/user-guide/agile-boards/#remove-lists",
    "https://www.openproject.org/docs/user-guide/agile-boards/#add-cards-to-a-list",
    "https://www.openproject.org/docs/user-guide/agile-boards/#update-cards",
    "https://www.openproject.org/docs/user-guide/agile-boards/#remove-cards",
    "https://www.openproject.org/docs/user-guide/agile-boards/#manage-boards",
    "https://www.openproject.org/docs/user-guide/agile-boards/#agile-boards-examples",
    "https://www.openproject.org/docs/user-guide/agile-boards/#basic-board"
  ],
  "entities": [],
  "language": "en",
  "content_hash": "0f6a640e4673fe37704db51a2832883f99cab6f8a2d79db4e86eeb70cf6727fd"
}