{
  "title": "Blog - OpenProject",
  "url": "https://www.openproject.org/blog/",
  "published_at": null,
  "updated_at": "2025-11-21T00:40:35.473771",
  "author": null,
  "tags": [
    "openproject",
    "guide",
    "learn",
    "with",
    "project",
    "your",
    "management",
    "about",
    "enterprise",
    "software"
  ],
  "content_type": "webpage",
  "word_count": 565,
  "content": "Blog Read our news, ideas & product updates here. How to use OpenProject as OKR software Digital sovereignty in Government: German State Premiers and the International Criminal Court choose openDesk OpenProject 16.6: Project evaluation and scoring Set and achieve your goals with open source software for OKRs (Objectives and Key Results) Software alternatives to Atlassian – free and open source CanSatLab: How to build a real satellite from a can with OpenProject 8 open source software solutions for the public sector OpenProject 16.5: Better planning and accessibility OpenProject integration app for Nextcloud released in version 2.10.0 Your search for a Jira Data Center alternative ends here PRINCE2 with OpenProject How to keep connected as a remote team: Game nights at OpenProject OpenProject 16.4: Option to auto-sync system color mode Free content planning tool: Practical tips for marketing teams using OpenProject How to work with project templates 7 features for successful programme management with OpenProject OpenProject 16.3: UX/UI Improvements AI-powered project and portfolio management with OpenProject Secure project management software with servers in the EU A PM²-based software solution for the European public sector 1 2 3 4 5 Next All User guides Docs Blog Website API Release notes First steps   Getting started Learn about the first steps with OpenProject Getting started Learn about the first steps with OpenProject All features   User guide In-depth guide of all features in OpenProject User guide In-depth guide of all features in OpenProject FAQ General frequently asked questions FAQ General frequently asked questions Use Cases Detailed step-by-step instructions Use Cases Detailed step-by-step instructions Glossary A dictionary of project management terms Glossary A dictionary of project management terms Enterprise edition guide Manage your OpenProject Enterprise edition Enterprise edition guide Manage your OpenProject Enterprise edition Project management guide Learn about project management with OpenProject Project management guide Learn about project management with OpenProject Security & privacy Data protection and information security are of central importance for the OpenProject team. Security & privacy Data protection and information security are of central importance for the OpenProject team. Contributions Guide Learn how to contribute to OpenProject Contributions Guide Learn how to contribute to OpenProject System admin guide Learn how to configure your OpenProject System admin guide Learn how to configure your OpenProject Release Notes See the latest changes in OpenProject Release Notes See the latest changes in OpenProject BIM Guide Additional BIM features for construction teams BIM Guide Additional BIM features for construction teams Installation and operations guide Find out how to install and operate OpenProject Installation and operations guide Find out how to install and operate OpenProject Development Learn about how to contribute to OpenProject Development Learn about how to contribute to OpenProject API Learn about the API powering OpenProject API Learn about the API powering OpenProject Most popular topics Installing OpenProject Learn how to download and install OpenProject on your own servers. Installing OpenProject Learn how to download and install OpenProject on your own servers. Enterprise add-ons Find out about the OpenProject Enterprise add-ons to boost your project management. Enterprise add-ons Find out about the OpenProject Enterprise add-ons to boost your project management. OpenProject hosting Get started easily with OpenProject hosting from the experts. OpenProject hosting Get started easily with OpenProject hosting from the experts. Support Find out how to get maintenance and support for OpenProject in your organization. Support Find out how to get maintenance and support for OpenProject in your organization.",
  "description": "Open source project management software for classic, agile or hybrid project management: task management✓ Gantt charts✓ boards✓ team collaboration✓ time and cost reporting✓ FREE trial!",
  "links": [
    "https://www.openproject.org/blog/okr-software-use-case/",
    "https://www.openproject.org/blog/digital-sovereignty-government-germany-opendesk/",
    "https://www.openproject.org/blog/openproject-16-6-release/",
    "https://www.openproject.org/blog/open-source-okr-software/",
    "https://www.openproject.org/blog/atlassian-alternative/",
    "https://www.openproject.org/blog/cansatlab-case-study-esa/",
    "https://www.openproject.org/blog/open-source-software-public-sector/",
    "https://www.openproject.org/blog/openproject-16-5-release/",
    "https://www.openproject.org/blog/nextcloud-integration-release-2-10/",
    "https://www.openproject.org/blog/jira-alternative-end-of-data-center/",
    "https://www.openproject.org/blog/prince2-with-openproject/",
    "https://www.openproject.org/blog/game-nights/",
    "https://www.openproject.org/blog/openproject-16-4-release/",
    "https://www.openproject.org/blog/free-team-content-planner/",
    "https://www.openproject.org/blog/project-templates/",
    "https://www.openproject.org/blog/programme-management/",
    "https://www.openproject.org/blog/openproject-16-3/",
    "https://www.openproject.org/blog/ai-project-portfolio-management/",
    "https://www.openproject.org/blog/pm-software-germany/",
    "https://www.openproject.org/blog/pm2-hackathon/"
  ],
  "entities": [],
  "language": "en",
  "content_hash": "70929c57c1f6cfde85540d13994900a17403a3b98a0449a86b05810b385572c7"
}