{
  "title": "Rich text (WYSIWYG) editor in OpenProject - OpenProject",
  "url": "https://www.openproject.org/docs/user-guide/wysiwyg/",
  "published_at": null,
  "updated_at": "2025-11-28T16:22:05.559431",
  "author": null,
  "tags": [
    "work",
    "package",
    "openproject",
    "embedding",
    "project",
    "attributes",
    "value",
    "table",
    "with",
    "macros"
  ],
  "content_type": "webpage",
  "word_count": 2641,
  "content": "On this page   Basic formatting   Line breaks   Links   Widgets and Newlines   Code Blocks   Tables   Autoformatting     Image handling   Keyboard shortcuts   Macros   Table of contents   Work package button   Include wiki page   Embed work package table and Gantt chart     Links to OpenProject resources   Autocompletion for work packages and users     Embedding of work package attributes and project attributes   Embedding of a work package value by work package ID   Embedding of a work package value by work package subject   Relative embedding of a work package value   Embedding of a project value by project ID   Relative embedding of a project value   Embedding attribute help texts     Attributes   Available attributes for work packages   Available attributes for projects Basic formatting   Line breaks   Links   Widgets and Newlines   Code Blocks   Tables   Autoformatting Line breaks Links Widgets and Newlines Code Blocks Tables Autoformatting Image handling Keyboard shortcuts Macros   Table of contents   Work package button   Include wiki page   Embed work package table and Gantt chart Table of contents Work package button Include wiki page Embed work package table and Gantt chart Links to OpenProject resources   Autocompletion for work packages and users Autocompletion for work packages and users Embedding of work package attributes and project attributes   Embedding of a work package value by work package ID   Embedding of a work package value by work package subject   Relative embedding of a work package value   Embedding of a project value by project ID   Relative embedding of a project value   Embedding attribute help texts Embedding of a work package value by work package ID Embedding of a work package value by work package subject Relative embedding of a work package value Embedding of a project value by project ID Relative embedding of a project value Embedding attribute help texts Attributes   Available attributes for work packages   Available attributes for projects Available attributes for work packages Available attributes for projects Rich text (WYSIWYG) editor in OpenProject OpenProject features a quasi-WYSIWYG editor, powered by CKSource CKEditor5. The underlying format is GitHub-flavored CommonMark (GFM) with additional HTML for e.g. mentions and image sizing. Note In some resources, such as work packages or comments, the editor does not exhibit all functionality, such as macros or image uploads. In the work package split screen view (details view), you may have to use the three vertical dots to access additional features of the editor. Basic formatting The CKEditor5 build in OpenProject supports basic text styles, such as bold and italic formatting, headings, strike-through, inline code, and quotes, as well as inline image handling. Pasting content such as images or rich text is also supported, while unsupported styling will be stripped by the editor. Line breaks Instead of creating a new paragraph with Enter, you can also press SHIFT+Enter to create a line break without creating a new paragraph. Links Create hyperlinks by pressing the tool-bar (optionally with some selected text), or by pressing CTRL+k to open a popup to enter the link here. Widgets and Newlines CKEditor uses widgets to display block elements such as images, tables, and other elements that are not inline. You can select most widgets by pressing on them - The only exception to that is the table widget, it has a little select knob at the top left to select the entire table. When you have a widget selected, you can remove or cut it. You can create a newline below it by selecting the widget and pressing ENTER or ↓ (ARROW DOWN), or a newline above it by pressing SHIFT+enter or ↑ (ARROW UP). This is especially needed when the widget is the first or last element on the page to insert a line below or above it. Code Blocks As CKEditor5 currently does not provide support for code blocks, OpenProject can display, but not edit code blocks within the CKEditor instance. A code block can be edited through a modal window within a CodeMirror editor instance. This has the advantage of providing syntax highlighting and code sensing (for supported languages). Tables The GFM extension of the CommonMark specs adds a definition for table syntax, which the CKEditor of OpenProject supports. This definition requires all tables to have a heading row. For tables created with CKEditor without heading rows, a HTML table is output instead. This matches the behavior of, e.g., GitHub. Autoformatting CKEditor5 allows certain CommonMark-like autoformatting keyboard strokes: Create bold or italic styles by typing **will become bold**, _will become italic_, Create heading of different indentation with #, ##, ###, … Create a bulleted list by starting the line with * or - and a space Create a numbered list by starting the line with 1. or 1) and a space Image handling In supported resources of OpenProject where attachments are allowed, you can add image",
  "description": "Find out about the CKEditor5 WYSIWYG editor in OpenProject",
  "links": [
    "https://www.openproject.org/docs/user-guide/wysiwyg/#rich-text-wysiwyg-editor-in-openproject",
    "https://www.openproject.org/docs/user-guide/wysiwyg/#basic-formatting",
    "https://www.openproject.org/docs/user-guide/wysiwyg/#line-breaks",
    "https://www.openproject.org/docs/user-guide/wysiwyg/#links",
    "https://www.openproject.org/docs/user-guide/wysiwyg/#widgets-and-newlines",
    "https://www.openproject.org/docs/user-guide/wysiwyg/#code-blocks",
    "https://www.openproject.org/docs/user-guide/wysiwyg/#tables",
    "https://www.openproject.org/docs/user-guide/wysiwyg/#autoformatting",
    "https://www.openproject.org/docs/user-guide/wysiwyg/#image-handling",
    "https://www.openproject.org/docs/user-guide/wysiwyg/#keyboard-shortcuts",
    "https://www.openproject.org/docs/user-guide/wysiwyg/#macros",
    "https://www.openproject.org/docs/user-guide/wysiwyg/#table-of-contents",
    "https://www.openproject.org/docs/user-guide/wysiwyg/#work-package-button",
    "https://www.openproject.org/docs/user-guide/wysiwyg/#include-wiki-page",
    "https://www.openproject.org/docs/user-guide/wysiwyg/#embed-work-package-table-and-gantt-chart",
    "https://www.openproject.org/docs/user-guide/wysiwyg/#links-to-openproject-resources",
    "https://www.openproject.org/docs/user-guide/wysiwyg/#autocompletion-for-work-packages-and-users",
    "https://www.openproject.org/docs/user-guide/wysiwyg/#embedding-of-work-package-attributes-and-project-attributes",
    "https://www.openproject.org/docs/user-guide/wysiwyg/#embedding-of-a-work-package-value-by-work-package-id",
    "https://www.openproject.org/docs/user-guide/wysiwyg/#embedding-of-a-work-package-value-by-work-package-subject"
  ],
  "entities": [],
  "language": "en",
  "content_hash": "4aff72c157763e0383ee318d63b08a1a796e78063109e13e71d9f9cbc1cc3efb"
}