{
  "title": "Customers: Who uses OpenProject?",
  "url": "https://www.openproject.org/customers/",
  "published_at": null,
  "updated_at": "2025-11-28T15:39:43.101475",
  "author": null,
  "tags": [
    "openproject",
    "project",
    "management",
    "guide",
    "your",
    "learn",
    "with",
    "about",
    "enterprise",
    "open"
  ],
  "content_type": "webpage",
  "word_count": 939,
  "content": "Powerful project management with OpenProject These are some of our amazing customers How successful organizations around the world use OpenProject to achieve great things together. We particularly like the hybrid approach of classic and agile project management. Together with our partner university in Novosibirsk, we set up a project in OpenProject to test an app for a mail order company and to design user improvements for it. The students use OpenProject for their work to network. The theoretical project management techniques are directly put into practice. By using OpenProject, the productivity of the project members was increased significantly. Prof. Dr. Eduard Gerhardt  Faculty of Economic Sciences  Coburg University Universities and research institutes OpenProject provides you with a secure and flexible open source project management software. It allows you to manage projects across a diversity of teams and departments. Think about including your students as well. OpenProject enables us to plan and structure projects quickly and comprehensibly, and thus to maintain an overview and stick to deadlines. At the same time, OpenProject allows us to have an efficient and sustainable exchange with customers and partners. Florian Rogge  Sales Director  go∼mus IT and technology Projects in IT and technology are often very complex and determined by many departments involved and remote working. OpenProject adapts to your project and will help you to efficiently reach your goal. OpenProject makes our project management much easier. The clear Gantt Chart visually supports the planning and can be easily edited. Collaboration in the team is made easier by the fact that all information is available to all project members transparently in one system at all times. In addition, we can optimally document and track the status of the work packages based on the activities. Daniel Meiler  Senior Project Officer  Rehabilitation Clinic Bellikon Healthcare Healthcare organizations are looking to professionally plan and implement complex projects. OpenProject is the open source solution for demanding project management. OpenProject helped me to visualize my project's timeline and have a better overview. Also, all my team members were able to have access to all project information at any time which reduced the coordination for me. Jana Schilling  Personnel and organizational development  District Office Enzkreis Public sector OpenProject provides high data security and supports public institutes in efficiently digitalizing processes. Easy and intuitive to use, you will get all project members on board quickly. OpenProject for me is the best open source project management software out there. It allows me to collect all projects and tasks under one umbrella and track the progress easily. It offers waterfall project management options, as well as agile. It has a great agile board that is easy to organize and prioritize backlog items. It gives us filters and quick views of assignments and percentage of work done. Jasmina Jocic  Project Manager  Linux Professional Institute NGOs & foundations OpenProject makes an impact by providing an open source project management software to effectively manage projects to maximize resources. Industries More industries using OpenProject successfully Construction Construction Automotive Automotive Universities and research institutes Universities and research institutes IT & Technology IT & Technology Health Care Health Care Public Sector Public Sector NGOs & Foundations NGOs & Foundations Engineering Engineering Banking & Insurance Banking & Insurance Aerospace Aerospace #1 Open Source Project Management Software Try OpenProject now with your team and get convinced! Test 14 days for FREE Easy and intuitive Open source All User guides Docs Blog Website API Release notes First steps   Getting started Learn about the first steps with OpenProject Getting started Learn about the first steps with OpenProject All features   User guide In-depth guide of all features in OpenProject User guide In-depth guide of all features in OpenProject FAQ General frequently asked questions FAQ General frequently asked questions Use Cases Detailed step-by-step instructions Use Cases Detailed step-by-step instructions Glossary A dictionary of project management terms Glossary A dictionary of project management terms Enterprise edition guide Manage your OpenProject Enterprise edition Enterprise edition guide Manage your OpenProject Enterprise edition Project management guide Learn about project management with OpenProject Project management guide Learn about project management with OpenProject Security & privacy Data protection and information security are of central importance for the OpenProject team. Security & privacy Data protection and information security are of central importance for the OpenProject team. Contributions Guide Learn how to contribute to OpenProject Contributions Guide Learn how to contribute to OpenPro",
  "description": "Open source project management software for classic, agile or hybrid project management: task management✓ Gantt charts✓ boards✓ team collaboration✓ time and cost reporting✓ FREE trial!",
  "links": [
    "https://www.openproject.org/project-management-universities-research/case-study-coburg-university/",
    "https://www.openproject.org/project-management-universities-research/",
    "https://www.openproject.org/project-management-it-technology/case-study-go-mus/",
    "https://www.openproject.org/project-management-it-technology/",
    "https://www.openproject.org/project-management-healthcare/case-study-rehab-clinic-bellikon/",
    "https://www.openproject.org/project-management-healthcare/",
    "https://www.openproject.org/project-management-public-sector/case-study-district-office-enzkreis/",
    "https://www.openproject.org/project-management-public-sector/",
    "https://www.openproject.org/project-management-ngos-foundations/case-study-linux-professional-institute/",
    "https://www.openproject.org/project-management-ngos-foundations/",
    "https://www.openproject.org/bim-project-management/",
    "https://www.openproject.org/project-management-automotive/",
    "https://www.openproject.org/project-management-universities-research/",
    "https://www.openproject.org/project-management-it-technology/",
    "https://www.openproject.org/project-management-healthcare/",
    "https://www.openproject.org/project-management-public-sector/",
    "https://www.openproject.org/project-management-ngos-foundations/",
    "https://www.openproject.org/project-management-engineering/",
    "https://www.openproject.org/project-management-banking-and-insurance/",
    "https://www.openproject.org/project-management-aerospace-and-aviation/"
  ],
  "entities": [],
  "language": "en",
  "content_hash": "4ef72d7bc7f4d0958f70df1dba864f2ce488b642726428a59d6d8b7b25b359c9"
}