{
  "title": "Documentation & Help - OpenProject",
  "url": "https://www.openproject.org/docs/",
  "published_at": null,
  "updated_at": "2025-11-21T00:40:24.227364",
  "author": null,
  "tags": [
    "openproject",
    "guide",
    "learn",
    "about",
    "your",
    "project",
    "management",
    "enterprise",
    "with",
    "find"
  ],
  "content_type": "webpage",
  "word_count": 382,
  "content": "Hello, how can we help you? All User guides Docs Blog Website API Release notes First steps   Getting started Learn about the first steps with OpenProject Getting started Learn about the first steps with OpenProject All features   User guide In-depth guide of all features in OpenProject User guide In-depth guide of all features in OpenProject FAQ General frequently asked questions FAQ General frequently asked questions Use Cases Detailed step-by-step instructions Use Cases Detailed step-by-step instructions Glossary A dictionary of project management terms Glossary A dictionary of project management terms Enterprise edition guide Manage your OpenProject Enterprise edition Enterprise edition guide Manage your OpenProject Enterprise edition Project management guide Learn about project management with OpenProject Project management guide Learn about project management with OpenProject Security & privacy Data protection and information security are of central importance for the OpenProject team. Security & privacy Data protection and information security are of central importance for the OpenProject team. Contributions Guide Learn how to contribute to OpenProject Contributions Guide Learn how to contribute to OpenProject System admin guide Learn how to configure your OpenProject System admin guide Learn how to configure your OpenProject Release Notes See the latest changes in OpenProject Release Notes See the latest changes in OpenProject BIM Guide Additional BIM features for construction teams BIM Guide Additional BIM features for construction teams Installation and operations guide Find out how to install and operate OpenProject Installation and operations guide Find out how to install and operate OpenProject Development Learn about how to contribute to OpenProject Development Learn about how to contribute to OpenProject API Learn about the API powering OpenProject API Learn about the API powering OpenProject Most popular topics Installing OpenProject Learn how to download and install OpenProject on your own servers. Installing OpenProject Learn how to download and install OpenProject on your own servers. Enterprise add-ons Find out about the OpenProject Enterprise add-ons to boost your project management. Enterprise add-ons Find out about the OpenProject Enterprise add-ons to boost your project management. OpenProject hosting Get started easily with OpenProject hosting from the experts. OpenProject hosting Get started easily with OpenProject hosting from the experts. Support Find out how to get maintenance and support for OpenProject in your organization. Support Find out how to get maintenance and support for OpenProject in your organization.",
  "description": "Open source project management software for classic, agile or hybrid project management: task management✓ Gantt charts✓ boards✓ team collaboration✓ time and cost reporting✓ FREE trial!",
  "links": [
    "https://www.openproject.org/docs/getting-started/",
    "https://www.openproject.org/docs/user-guide/",
    "https://www.openproject.org/docs/faq/",
    "https://www.openproject.org/docs/use-cases/",
    "https://www.openproject.org/docs/glossary/",
    "https://www.openproject.org/docs/enterprise-guide/",
    "https://www.openproject.org/docs/project-management-guide",
    "https://www.openproject.org/docs/security-and-privacy/",
    "https://www.openproject.org/docs/contributions-guide/",
    "https://www.openproject.org/docs/system-admin-guide/",
    "https://www.openproject.org/docs/release-notes/",
    "https://www.openproject.org/docs/bim-guide/",
    "https://www.openproject.org/docs/installation-and-operations/",
    "https://www.openproject.org/docs/development/",
    "https://www.openproject.org/docs/api/",
    "https://www.openproject.org/docs/installation-and-operations",
    "https://www.openproject.org/enterprise-edition/#enterprise-add-ons",
    "https://www.openproject.org/enterprise-edition/#hosting-options",
    "https://www.openproject.org/pricing#support"
  ],
  "entities": [],
  "language": "en",
  "content_hash": "0d107a91c2dac2f44849af2c9db86da01a09528181b0ed92ec9df36defc7b571"
}