{
  "title": "Calendar - OpenProject",
  "url": "https://www.openproject.org/docs/user-guide/calendar/",
  "published_at": null,
  "updated_at": "2025-11-28T15:39:29.699223",
  "author": null,
  "tags": [
    "calendar",
    "work",
    "openproject",
    "packages",
    "project",
    "your",
    "create",
    "that",
    "learn",
    "guide"
  ],
  "content_type": "webpage",
  "word_count": 1884,
  "content": "On this page   Create a new calendar   Use the calendar   View work packages   Create work packages   Modify work packages   Filters   Include other projects   Embed a calendar in the project overview   Zen mode     Subscribe to a calendar Create a new calendar Use the calendar   View work packages   Create work packages   Modify work packages   Filters   Include other projects   Embed a calendar in the project overview   Zen mode View work packages Create work packages Modify work packages Filters Include other projects Embed a calendar in the project overview Zen mode Subscribe to a calendar Calendar The Calendar module gives you an overview of work packages scheduled in a particular month or week. This makes it easier to track and follow multiple parallel tasks and get a sense of how a project will evolve (or has evolved) over time. You must first enable the Calendar module in your project settings to use it. Create a new calendar Once enabled, clicking on the Calendars entry on the left sidebar takes you to the Calendar module with a list of all existing calendars. Initially, it will be empty. You can create a new calendar by clicking on either the + Calendar button at the top right corner near your avatar or at the bottom of the sidebar on the left. Click on an existing (saved) calendar to view it. You can change the visibility settings of any calendar by clicking on [⋮] more -> Visibility settings.  Any calendar that has the Favorited option checked will be displayed under the Favorite heading in the sidebar to the left. Any calendar that has the Public option checked will be visible to all members of the current project and listed under the Public heading in the sidebar to the left. Any calendar that has the Public option unchecked will be considered private and displayed under the Private heading in the menu bar to the left. Any calendar that has the Favorited option checked will be displayed under the Favorite heading in the sidebar to the left. Any calendar that has the Public option checked will be visible to all members of the current project and listed under the Public heading in the sidebar to the left. Any calendar that has the Public option unchecked will be considered private and displayed under the Private heading in the menu bar to the left. Use the calendar View work packages When you open a new calendar, all work packages within the current project are displayed as horizontal strips that span all dates between the start and finish dates (inclusive). The color represents the work package type. The subject or title displayed on the strip (insomuch as the length allows). The current month is automatically selected. You can use the previews/next arrow controls (←, →) in the top left corner to move forwards or backwards in time. The today button brings you back to the current date. You can use the month/week toggle on the top right corner to switch between either a month view or a week view. If multiple work packages are scheduled on the same day, they are displayed in a vertical stack. Click on a work package strip to view the work package in split screen mode. Create work packages You can create new work packages directly on the calendar. To do so, either click on a single date or click and drag across a date range. A new work package form will open in a split screen with the selected date(s) pre-filled. Modify work packages You can make basic date modifications simply by manipulating the work package strips: Change the start date by grabbing the drag handle on the left edge of the strip and extending or shortening it. Change the finish date by grabbing the drag handle on the right edge of the strip and extending or shortening it. Drag an entire strip to move the work package forwards or backwards in time whilst preserving duration. Note: The calendar will highlight non-working days with a darker background color. By default, a work package cannot be dragged or resized such that it begins or ends on these days unless the “Working days only” switch is turned off for that work package. To learn how to do this, refer to the documentation on Working days and duration. Work packages can also expand and retract in width depending on how many non-working days are spanned. For example, a 3-day task starting on Thursday and ending on Monday will spread across 5 calendar days. Dragging that same work package so that it starts on a Tuesday and ends on a Thursday means that it will spread across 3 calendar days. In both cases, the duration remains 3 days. Filters You can filter the work packages displayed in a calendar by adding any number of filters, e.g. Author, Due Date, Priority, Assignee, etc. This allows you to create a custom calendar showing only relevant work packages, either for yourself (as a private calendar) or for your team (as a public calendar visible to all project members). Click the Filter button on the top right above the calendar to open the filter details.To add another",
  "description": "How to create, use and subscribe to a calendar in OpenProject.",
  "links": [
    "https://www.openproject.org/docs/user-guide/calendar/#calendar",
    "https://www.openproject.org/docs/user-guide/calendar/#create-a-new-calendar",
    "https://www.openproject.org/docs/user-guide/calendar/#use-the-calendar",
    "https://www.openproject.org/docs/user-guide/calendar/#view-work-packages",
    "https://www.openproject.org/docs/user-guide/calendar/#create-work-packages",
    "https://www.openproject.org/docs/user-guide/calendar/#modify-work-packages",
    "https://www.openproject.org/docs/user-guide/calendar/#filters",
    "https://www.openproject.org/docs/user-guide/calendar/#include-other-projects",
    "https://www.openproject.org/docs/user-guide/calendar/#embed-a-calendar-in-the-project-overview",
    "https://www.openproject.org/docs/user-guide/calendar/#zen-mode",
    "https://www.openproject.org/docs/user-guide/calendar/#subscribe-to-a-calendar",
    "https://www.openproject.org/docs/user-guide/calendar/#calendar",
    "https://www.openproject.org/docs/user-guide/projects/project-settings/modules",
    "https://www.openproject.org/docs/user-guide/calendar/#create-a-new-calendar",
    "https://www.openproject.org/docs/user-guide/calendar/#use-the-calendar",
    "https://www.openproject.org/docs/user-guide/calendar/#subscribe-to-a-calendar",
    "https://www.openproject.org/docs/user-guide/calendar/#create-a-new-calendar",
    "https://www.openproject.org/docs/user-guide/calendar/#use-the-calendar",
    "https://www.openproject.org/docs/user-guide/calendar/#view-work-packages",
    "https://www.openproject.org/docs/system-admin-guide/manage-work-packages/work-package-types"
  ],
  "entities": [],
  "language": "en",
  "content_hash": "6f7981b3f0673ea30565a2f796399a2ee0b77a171a27b84187d0112731a8eade"
}