{
  "title": "Project News - OpenProject",
  "url": "https://www.openproject.org/docs/user-guide/news/",
  "published_at": null,
  "updated_at": "2025-11-28T16:21:46.210773",
  "author": null,
  "tags": [
    "news",
    "openproject",
    "entry",
    "project",
    "page",
    "your",
    "latest",
    "guide",
    "learn",
    "section"
  ],
  "content_type": "webpage",
  "word_count": 1184,
  "content": "On this page   Comment on news   Watch a news entry   Edit a news entry   Add a news entry   Delete a news entry   Latest news section on the OpenProject landing page   Latest news section on the project overview page Comment on news Watch a news entry Edit a news entry Add a news entry Delete a news entry Latest news section on the OpenProject landing page Latest news section on the project overview page Project News On the news page, you can see the latest news in a project in reverse chronological order. News communicate general topics to all team members. News are defined as a module that allows the publication and use of news entries. They can be displayed on the main project overview page. Comment on news In the News module in the project menu on the left, you will see all news from a project. Click the Subject to read to details and comment on news. In the news details, click the Add a comment link to comment on the news. Type in your comment and click the blue Add button. Your comment, along with all other comments, is then displayed below the news entry description, newest first. Watch a news entry You can also decide to watch a news entry. As a watcher, you will receive an e-mail notification if a news entry is changed or if a comment has been added to a news article. To become a watcher, click the Watch button in the top right corner of a news entry’s details view. If you want to stop watching a news entry, simply click on Unwatch. Edit a news entry You can also always go back and make changes to an existing news entry. To do so, select the respective news from the overview page by clicking on its subject. In the detail view of the entry, click the Edit button in the top right corner. A form appears allowing you to make adjustments to title, summary and description. The original entry is displayed at the bottom of the page. Make your changes and click on the blue Save button to finish. Add a news entry To add a new news entry, click on Add news in the toolbar in the upper right side. A new window will open, allowing you to enter title, summary and description. The title and summary will be displayed in the project overview or on the main OpenProject landing page in the News section. You can further edit the content of your news by using the provided basic formatting options from the text editor. Also, you are able to enter Macros, e.g. Work package tables, or Work package create buttons. To finish and publish the entry, click on Create. Delete a news entry To delete a news entry, click on the Delete button in the top right corner of the respective entry’s detail view. Latest news section on the OpenProject landing page On the OpenProject landing page of the application, you have a latest news section. Here, all latest news from all your projects will be summarized. Clicking on the title of a news will bring you to the news details in the corresponding project. Latest news section on the project overview page You can also include your latest news from a project on the Project overview page. Find out how to configure your Project overview page. Help and feedback Get help Get help Docs feedback Docs feedback Product feedback Product feedback Get more features Get more features Look up project management terms in our dictionary If you need help from the community or want to support others If you are eligible for professional support and have more questions If you find an easily fixable error or need for improvement in the documentation If you would like to suggest bigger updates or improvements to this documentation If you want to contribute to translate this documentation to another language If there’s something you don’t like or understand about this feature If you want to propose a new feature that OpenProject does not offer yet To further help OpenProject to shape and test new features To view OpenProject Enterprise add-ons and pricing If you want to try all Enterprise add-ons in the OpenProject Enterprise cloud 14 days for free If you want to try all Enterprise add-ons in your on premise Community installation 14 days for free On this page   Comment on news   Watch a news entry   Edit a news entry   Add a news entry   Delete a news entry   Latest news section on the OpenProject landing page   Latest news section on the project overview page Comment on news Watch a news entry Edit a news entry Add a news entry Delete a news entry Latest news section on the OpenProject landing page Latest news section on the project overview page All User guides Docs Blog Website API Release notes First steps   Getting started Learn about the first steps with OpenProject Getting started Learn about the first steps with OpenProject All features   User guide In-depth guide of all features in OpenProject User guide In-depth guide of all features in OpenProject FAQ General frequently asked questions FAQ General frequently asked questions Use Cases Detailed step-by-step instructions Use Cases Detailed step-by-s",
  "description": "Communicate project news to your team members",
  "links": [
    "https://www.openproject.org/docs/user-guide/news/#project-news",
    "https://www.openproject.org/docs/user-guide/news/#comment-on-news",
    "https://www.openproject.org/docs/user-guide/news/#watch-a-news-entry",
    "https://www.openproject.org/docs/user-guide/news/#edit-a-news-entry",
    "https://www.openproject.org/docs/user-guide/news/#add-a-news-entry",
    "https://www.openproject.org/docs/user-guide/news/#delete-a-news-entry",
    "https://www.openproject.org/docs/user-guide/news/#latest-news-section-on-the-openproject-landing-page",
    "https://www.openproject.org/docs/user-guide/news/#latest-news-section-on-the-project-overview-page",
    "https://www.openproject.org/docs/user-guide/news/#project-news",
    "https://www.openproject.org/docs/user-guide/news/#comment-on-news",
    "https://www.openproject.org/docs/user-guide/news/#watch-a-news-entry",
    "https://www.openproject.org/docs/user-guide/news/#edit-a-news-entry",
    "https://www.openproject.org/docs/user-guide/news/#add-a-news-entry",
    "https://www.openproject.org/docs/user-guide/news/#delete-a-news-entry",
    "https://www.openproject.org/docs/user-guide/news/#comment-on-news",
    "https://www.openproject.org/docs/user-guide/news/#watch-a-news-entry",
    "https://www.openproject.org/docs/user-guide/news/#edit-a-news-entry",
    "https://www.openproject.org/docs/user-guide/news/#add-a-news-entry",
    "https://www.openproject.org/docs/user-guide/news/#delete-a-news-entry",
    "https://www.openproject.org/docs/user-guide/news/#latest-news-section-on-the-openproject-landing-page"
  ],
  "entities": [],
  "language": "en",
  "content_hash": "41e9d79a4ce500dc8f78e69c689e91ee1ae4b83b94eabc6f2432f1c41be80f13"
}