{
  "title": "Installation & operations guide - OpenProject",
  "url": "https://www.openproject.org/docs/installation-and-operations/",
  "published_at": null,
  "updated_at": "2025-11-21T00:40:34.124784",
  "author": null,
  "tags": [
    "openproject",
    "enterprise",
    "guide",
    "edition",
    "learn",
    "installation",
    "your",
    "premises",
    "management",
    "about"
  ],
  "content_type": "webpage",
  "word_count": 900,
  "content": "On this page   On-premises   Hosted   On-premises installation overview On-premises Hosted On-premises installation overview Installation & operations guide This page summarizes the options for getting OpenProject, some hosted and some on-premise. With this information you should be able to decide what option is best for you. Find a full feature comparison here. On-premises Community edition - The free, no license, edition of OpenProject that you install on-premise. The additional add-ons of the Enterprise edition are not included. See the “Installation” row of the table below. Enterprise on-premise edition - Builds on top of the Community edition: Enterprise add-ons, professional support, hosted on-premises with optional installation support. See more on the website, where you can apply for a free trial, or in the documentation. The Community edition can easily be upgraded to the Enterprise on-premises edition. Hosted Enterprise Enterprise cloud edition - Hosted by OpenProject in an EU Data Center, with Enterprise add-ons and professional support . See more on the website, where you can apply for a free trial, or in the documentation. All editions can be enhanced by adding the BIM module, including features for construction project management, i.e. 3D model viewer, BCF management. See how to switch to that edition in the documentation or how to start a BIM Enterprise cloud edition. Compare the features of these versions on the website. Note: there are some minor options given in the “Other” row of the table below. These are not recommended but you may wish to try them. On-premises installation overview For production environments and when using a supported distribution, we recommend using the packaged installation. This will install OpenProject as a system dependency using your distribution’s package manager, and provide updates in the same fashion that all other system packages do. An OUTDATED and OLD manual installation option exists, but due to the large number of components involved and the rapid evolution of OpenProject, we cannot ensure that the procedure is either up-to-date or that it will correctly work on your machine. This means that manual installation is NOT recommended NOR supported. Help and feedback Get help Get help Docs feedback Docs feedback Product feedback Product feedback Get more features Get more features Look up project management terms in our dictionary If you need help from the community or want to support others If you are eligible for professional support and have more questions If you find an easily fixable error or need for improvement in the documentation If you would like to suggest bigger updates or improvements to this documentation If you want to contribute to translate this documentation to another language If there’s something you don’t like or understand about this feature If you want to propose a new feature that OpenProject does not offer yet To further help OpenProject to shape and test new features To view OpenProject Enterprise add-ons and pricing If you want to try all Enterprise add-ons in the OpenProject Enterprise cloud 14 days for free If you want to try all Enterprise add-ons in your on premise Community installation 14 days for free On this page   On-premises   Hosted   On-premises installation overview On-premises Hosted On-premises installation overview All User guides Docs Blog Website API Release notes First steps   Getting started Learn about the first steps with OpenProject Getting started Learn about the first steps with OpenProject All features   User guide In-depth guide of all features in OpenProject User guide In-depth guide of all features in OpenProject FAQ General frequently asked questions FAQ General frequently asked questions Use Cases Detailed step-by-step instructions Use Cases Detailed step-by-step instructions Glossary A dictionary of project management terms Glossary A dictionary of project management terms Enterprise edition guide Manage your OpenProject Enterprise edition Enterprise edition guide Manage your OpenProject Enterprise edition Project management guide Learn about project management with OpenProject Project management guide Learn about project management with OpenProject Security & privacy Data protection and information security are of central importance for the OpenProject team. Security & privacy Data protection and information security are of central importance for the OpenProject team. Contributions Guide Learn how to contribute to OpenProject Contributions Guide Learn how to contribute to OpenProject System admin guide Learn how to configure your OpenProject System admin guide Learn how to configure your OpenProject Release Notes See the latest changes in OpenProject Release Notes See the latest changes in OpenProject BIM Guide Additional BIM features for construction teams BIM Guide Additional BIM features for construction teams Installation and operations guide Find out how to install and operate Ope",
  "description": "Open source project management software for classic, agile or hybrid project management: task management✓ Gantt charts✓ boards✓ team collaboration✓ time and cost reporting✓ FREE trial!",
  "links": [
    "https://www.openproject.org/docs/installation-and-operations/#installation--operations-guide",
    "https://www.openproject.org/docs/installation-and-operations/#on-premises",
    "https://www.openproject.org/docs/installation-and-operations/#hosted",
    "https://www.openproject.org/docs/installation-and-operations/#on-premises-installation-overview",
    "https://www.openproject.org/docs/installation-and-operations/#installation--operations-guide",
    "https://www.openproject.org/pricing/#features",
    "https://www.openproject.org/docs/installation-and-operations/#on-premises",
    "https://www.openproject.org/enterprise-edition/",
    "https://www.openproject.org/docs/enterprise-guide/enterprise-on-premises-guide",
    "https://www.openproject.org/docs/installation-and-operations/#hosted",
    "https://www.openproject.org/enterprise-edition/#hosting-options",
    "https://www.openproject.org/docs/enterprise-guide/enterprise-cloud-guide",
    "https://www.openproject.org/docs/bim-guide",
    "https://www.openproject.org/docs/installation-and-operations/bim-edition",
    "https://www.openproject.org/pricing/#features",
    "https://www.openproject.org/docs/installation-and-operations/#on-premises-installation-overview",
    "https://www.openproject.org/docs/installation-and-operations/system-requirements",
    "https://www.openproject.org/docs/installation-and-operations/installation",
    "https://www.openproject.org/docs/installation-and-operations/operation",
    "https://www.openproject.org/docs/installation-and-operations/configuration"
  ],
  "entities": [],
  "language": "en",
  "content_hash": "0c2f6f7b11590597cd38e1721e339888c955cf19b92d1424c95569118fbceb0f"
}