{
  "title": "Manage projects - OpenProject",
  "url": "https://www.openproject.org/docs/user-guide/projects/",
  "published_at": null,
  "updated_at": "2025-11-28T15:39:46.882647",
  "author": null,
  "tags": [
    "project",
    "openproject",
    "guide",
    "your",
    "enterprise",
    "learn",
    "create",
    "about",
    "settings",
    "find"
  ],
  "content_type": "webpage",
  "word_count": 977,
  "content": "On this page   Project structure   Select a project   Create a new project   Create a subproject   Project Settings Project structure Select a project Create a new project Create a subproject Project Settings Manage projects In OpenProject you can create projects to collaborate with your team members, track issues, document and share information with stakeholders, organize things. A project is a way to structure and organize your work in OpenProject. Your projects can be available publicly or internally. OpenProject does not limit the number of projects, neither in the Community edition nor in the Enterprise cloud or in Enterprise on-premises edition. Your browser does not support the video tag. Project structure Projects form a structure in OpenProject. You can have parent projects and sub-projects. A project can represent an organizational unit of a company, e.g. to have issues separated: Company (Parent project)  Marketing (Sub-project) Sales HR IT … Marketing (Sub-project) Sales HR IT … Projects can also be for overarching teams working on one topic: Launch a new product  Design Development … Design Development … Or, a project can be used to separate products or customers. Product A  Customer A Customer B Customer C Customer A Customer B Customer C Note You must be a member of a project to view and work in it. Select a project Find out how to open an existing project in OpenProject in our Getting started guide. Create a new project Find out how to create a new project in OpenProject in our Getting started guide. Create a subproject Find out how to create a subproject in OpenProject in our Project settings guide. Project Settings You can specify further advanced settings for your project. Navigate to your project settings by selecting a project, and click -> Project settings -> Information. Here you can: Define whether the project should have a parent by selecting Subproject of. This way, you can change the project hierarchy. Define whether the project should have a parent by selecting Subproject of. This way, you can change the project hierarchy. Enter a detailed description for your project. Enter a detailed description for your project. Set the default project Identifier. Set the default project Identifier. Set a project to Public. This means it can be accessed without signing in to OpenProject. Set a project to Public. This means it can be accessed without signing in to OpenProject. Read the full guide on project settings in OpenProject. Help and feedback Get help Get help Docs feedback Docs feedback Product feedback Product feedback Get more features Get more features Look up project management terms in our dictionary If you need help from the community or want to support others If you are eligible for professional support and have more questions If you find an easily fixable error or need for improvement in the documentation If you would like to suggest bigger updates or improvements to this documentation If you want to contribute to translate this documentation to another language If there’s something you don’t like or understand about this feature If you want to propose a new feature that OpenProject does not offer yet To further help OpenProject to shape and test new features To view OpenProject Enterprise add-ons and pricing If you want to try all Enterprise add-ons in the OpenProject Enterprise cloud 14 days for free If you want to try all Enterprise add-ons in your on premise Community installation 14 days for free On this page   Project structure   Select a project   Create a new project   Create a subproject   Project Settings Project structure Select a project Create a new project Create a subproject Project Settings All User guides Docs Blog Website API Release notes First steps   Getting started Learn about the first steps with OpenProject Getting started Learn about the first steps with OpenProject All features   User guide In-depth guide of all features in OpenProject User guide In-depth guide of all features in OpenProject FAQ General frequently asked questions FAQ General frequently asked questions Use Cases Detailed step-by-step instructions Use Cases Detailed step-by-step instructions Glossary A dictionary of project management terms Glossary A dictionary of project management terms Enterprise edition guide Manage your OpenProject Enterprise edition Enterprise edition guide Manage your OpenProject Enterprise edition Project management guide Learn about project management with OpenProject Project management guide Learn about project management with OpenProject Security & privacy Data protection and information security are of central importance for the OpenProject team. Security & privacy Data protection and information security are of central importance for the OpenProject team. Contributions Guide Learn how to contribute to OpenProject Contributions Guide Learn how to contribute to OpenProject System admin guide Learn how to configure your OpenProject System admin guid",
  "description": "Manage projects in OpenProject",
  "links": [
    "https://www.openproject.org/docs/user-guide/projects/#manage-projects",
    "https://www.openproject.org/docs/user-guide/projects/#project-structure",
    "https://www.openproject.org/docs/user-guide/projects/#select-a-project",
    "https://www.openproject.org/docs/user-guide/projects/#create-a-new-project",
    "https://www.openproject.org/docs/user-guide/projects/#create-a-subproject",
    "https://www.openproject.org/docs/user-guide/projects/#project-settings",
    "https://www.openproject.org/docs/user-guide/projects/#manage-projects",
    "https://www.openproject.org/docs/getting-started/projects/#open-an-existing-project",
    "https://www.openproject.org/docs/getting-started/projects/#create-a-new-project",
    "https://www.openproject.org/docs/user-guide/projects/project-settings/project-information/#create-a-subproject",
    "https://www.openproject.org/docs/user-guide/projects/#project-structure",
    "https://www.openproject.org/docs/user-guide/projects/project-settings",
    "https://www.openproject.org/docs/user-guide/projects/project-lists",
    "https://www.openproject.org/docs/user-guide/projects/project-settings/project-information/#change-the-project-hierarchy",
    "https://www.openproject.org/docs/user-guide/projects/project-settings/project-information/#make-a-project-public",
    "https://www.openproject.org/docs/user-guide/projects/project-templates/#create-a-project-template",
    "https://www.openproject.org/docs/user-guide/projects/project-templates/#use-a-project-template",
    "https://www.openproject.org/docs/user-guide/projects/project-settings/project-information/#copy-a-project",
    "https://www.openproject.org/docs/user-guide/projects/project-settings/project-information/#archive-a-project",
    "https://www.openproject.org/docs/user-guide/projects/project-settings/project-information/#delete-a-project"
  ],
  "entities": [],
  "language": "en",
  "content_hash": "dfddaaf272ffe28263a94a9cabf5c4908aa20032b5cac306a98bfeb4f3eef641"
}