{
  "title": "Wiki - OpenProject",
  "url": "https://www.openproject.org/docs/user-guide/wiki/",
  "published_at": null,
  "updated_at": "2025-11-21T00:40:29.280270",
  "author": null,
  "tags": [
    "openproject",
    "work",
    "table",
    "package",
    "links",
    "with",
    "guide",
    "project",
    "your",
    "learn"
  ],
  "content_type": "webpage",
  "word_count": 1735,
  "content": "On this page   General wiki information   Basic formatting   Line breaks   Links   Widgets and Newlines   Code Blocks   Tables   Emojis   Autoformatting     Image handling   Macros   Table of contents   Embed work package table and Gantt chart   Work package button   Links to child pages     Full vs constrained editor   Links to OpenProject resources   Autocompletion for work packages General wiki information   Basic formatting   Line breaks   Links   Widgets and Newlines   Code Blocks   Tables   Emojis   Autoformatting Basic formatting Line breaks Links Widgets and Newlines Code Blocks Tables Emojis Autoformatting Image handling Macros   Table of contents   Embed work package table and Gantt chart   Work package button   Links to child pages Table of contents Embed work package table and Gantt chart Work package button Links to child pages Full vs constrained editor Links to OpenProject resources   Autocompletion for work packages Autocompletion for work packages Wiki In a project wiki you can collaboratively create and document information with your team, such as project documentation, specifications, guidelines, or any other important project information. Wiki is defined as a module that allows to use textile-based wiki pages. In order to use the wiki module, it has to be activated in the project settings. General wiki information OpenProject’s wiki and all other text input fields include a WYSIWYG editor, powered by CKSource CKEditor5. The underlying format is GitHub-flavored CommonMark (GFM). All previous textile-based content will be migrated when upgrading to OpenProject 8.0. Basic formatting The text editor in OpenProject supports basic text styles, such as bold and italic formatting, headings, strikethrough, inline code, and quotes as well as inline image handling. Pasting content such as images or rich text is also supported, while unsupported styling will be stripped by the editor. Simply type in your text in the input field, highlight a text and select the formatting via the toolbar on top. Line breaks Instead of creating a new paragraph with Enter, you can also press SHIFT+Enter to create a line break without creating a new paragraph. Links Create hyperlinks by pressing the link icon in the toolbar (optionally with some selected text), or by pressing CTRL+k to open a popup to enter the link href. Widgets and Newlines CKEditor uses widgets to display block elements such as images, tables, and other elements that are not inline. You can select most widgets by pressing on it - The only exception to that is the table widget, it has a little select knob at the top left to select the entire table. When you have a widget selected, you can remove or cut it. You can create a newline below it by selecting the widget and pressing ENTER or ↓ (ARROW DOWN), or a newline above it by pressing SHIFT+enter or ↑ (ARROW UP). This is especially needed when the widget is the first or last element on the page to insert a line below or above it. Code Blocks As CKEditor5 currently does not provide support for code blocks, OpenProject can display, but not edit code blocks within the CKEditor instance. A code block can be edited through a modal window within a CodeMirror editor instance. This has the advantage of providing syntax highlighting and code sensing (for supported languages). Tables The GFM extension of the CommonMark specs adds a definition for table syntax which the CKEditor build of OpenProject supports. This definition requires all tables to have a heading row. For tables created with CKEditor without heading rows, a HTML table is output instead. This matches the behavior of, e.g., GitHub. Emojis Starting with OpenProject 13.0 you can add emojis to all text editors. Type a colon and a letter, e.g. :a into the wiki editor and get a suggested list of emojis you can use. Autoformatting CKEditor5 allows certain CommonMark-like autoformatting keyboard strokes: Image handling In supported resources of OpenProject where attachments are allowed, you can add images to the page by either using the toolbar button, pasting an image from your clipboard, or drag & drop an image onto the editor. The attachment will be automatically uploaded and stored as an attachment. Macros OpenProject has supported macros on textile formatted pages and continues to do so with the WYSIWYG editor. Note that macros are not expanded while editing the page, instead a placeholder is shown. Table of contents Where applicable, the table of contents (TOC) macro will output a listing of all headings on the current page. Embed work package table and Gantt chart This is the most flexible macro that provides extensive functionality regarding the inclusion of dynamic work package tables with all the potential of the regular work package table. By adding an embedded work package table through the toolbar, you can configure the table view (such as columns, grouping, filters, and further properties) in a popup window. The rendered page will then ",
  "description": "Create and manage a wiki in OpenProject.",
  "links": [
    "https://www.openproject.org/docs/user-guide/wiki/#wiki",
    "https://www.openproject.org/docs/user-guide/wiki/#general-wiki-information",
    "https://www.openproject.org/docs/user-guide/wiki/#basic-formatting",
    "https://www.openproject.org/docs/user-guide/wiki/#line-breaks",
    "https://www.openproject.org/docs/user-guide/wiki/#links",
    "https://www.openproject.org/docs/user-guide/wiki/#widgets-and-newlines",
    "https://www.openproject.org/docs/user-guide/wiki/#code-blocks",
    "https://www.openproject.org/docs/user-guide/wiki/#tables",
    "https://www.openproject.org/docs/user-guide/wiki/#emojis",
    "https://www.openproject.org/docs/user-guide/wiki/#autoformatting",
    "https://www.openproject.org/docs/user-guide/wiki/#image-handling",
    "https://www.openproject.org/docs/user-guide/wiki/#macros",
    "https://www.openproject.org/docs/user-guide/wiki/#table-of-contents",
    "https://www.openproject.org/docs/user-guide/wiki/#embed-work-package-table-and-gantt-chart",
    "https://www.openproject.org/docs/user-guide/wiki/#work-package-button",
    "https://www.openproject.org/docs/user-guide/wiki/#links-to-child-pages",
    "https://www.openproject.org/docs/user-guide/wiki/#full-vs-constrained-editor",
    "https://www.openproject.org/docs/user-guide/wiki/#links-to-openproject-resources",
    "https://www.openproject.org/docs/user-guide/wiki/#autocompletion-for-work-packages",
    "https://www.openproject.org/docs/user-guide/wiki/#wiki"
  ],
  "entities": [],
  "language": "en",
  "content_hash": "9eba23ff99657a8b39426d80cdb4da637821523e8eb64242e6f7e6c688d358f8"
}