{
  "title": "API documentation",
  "url": "https://www.openproject.org/api/",
  "published_at": null,
  "updated_at": "2025-11-21T00:40:57.048388",
  "author": null,
  "tags": [
    "openproject",
    "guide",
    "learn",
    "this",
    "enterprise",
    "specification",
    "about",
    "your",
    "management",
    "project"
  ],
  "content_type": "webpage",
  "word_count": 818,
  "content": "On this page   API v3   OpenAPI specification     BCF v2.1 API v3   OpenAPI specification OpenAPI specification BCF v2.1 OpenProject API OpenProject offers two APIs. The general purpose HATEOAS API v3 and the BCF API v2.1 api targeted towards BIM use cases. Please note that we intend to keep this specification as accurate and stable as possible, however work on the API is still ongoing and not all resources and actions in OpenProject are yet accessible through the API. This document will be subject to changes as we add more endpoints and functionality to the API. The development version of this document may have breaking changes while we work on new endpoints for the application. We try to keep stable releases of OpenProject with changes to this API backwards compatible whenever possible. API v3 The API v3 is a general purpose API supporting multiple use cases. While by no means complete, a whole lot of different scenarios can be automatized which otherwise would have to be carried out by hand via the UI. Examples for this include managing work packages, projects and users. ➔ Go to OpenProject API OpenAPI specification Download the API specification in OpenAPI format as json or yml. BCF v2.1 This API supports BCF management in the context of BIM projects. While this API supports way less use cases than the more generic API v3 it is compatible with the generic specification of a BCF API as defined by the standard. This, clients implementing the specification can manage topics and viewpoints. ➔ Go to BCF API Help and feedback Get help Get help Docs feedback Docs feedback Product feedback Product feedback Get more features Get more features Look up project management terms in our dictionary If you need help from the community or want to support others If you are eligible for professional support and have more questions If you find an easily fixable error or need for improvement in the documentation If you would like to suggest bigger updates or improvements to this documentation If you want to contribute to translate this documentation to another language If there’s something you don’t like or understand about this feature If you want to propose a new feature that OpenProject does not offer yet To further help OpenProject to shape and test new features To view OpenProject Enterprise add-ons and pricing If you want to try all Enterprise add-ons in the OpenProject Enterprise cloud 14 days for free If you want to try all Enterprise add-ons in your on premise Community installation 14 days for free On this page   API v3   OpenAPI specification     BCF v2.1 API v3   OpenAPI specification OpenAPI specification BCF v2.1 All User guides Docs Blog Website API Release notes First steps   Getting started Learn about the first steps with OpenProject Getting started Learn about the first steps with OpenProject All features   User guide In-depth guide of all features in OpenProject User guide In-depth guide of all features in OpenProject FAQ General frequently asked questions FAQ General frequently asked questions Use Cases Detailed step-by-step instructions Use Cases Detailed step-by-step instructions Glossary A dictionary of project management terms Glossary A dictionary of project management terms Enterprise edition guide Manage your OpenProject Enterprise edition Enterprise edition guide Manage your OpenProject Enterprise edition Project management guide Learn about project management with OpenProject Project management guide Learn about project management with OpenProject Security & privacy Data protection and information security are of central importance for the OpenProject team. Security & privacy Data protection and information security are of central importance for the OpenProject team. Contributions Guide Learn how to contribute to OpenProject Contributions Guide Learn how to contribute to OpenProject System admin guide Learn how to configure your OpenProject System admin guide Learn how to configure your OpenProject Release Notes See the latest changes in OpenProject Release Notes See the latest changes in OpenProject BIM Guide Additional BIM features for construction teams BIM Guide Additional BIM features for construction teams Installation and operations guide Find out how to install and operate OpenProject Installation and operations guide Find out how to install and operate OpenProject Development Learn about how to contribute to OpenProject Development Learn about how to contribute to OpenProject API Learn about the API powering OpenProject API Learn about the API powering OpenProject Most popular topics Installing OpenProject Learn how to download and install OpenProject on your own servers. Installing OpenProject Learn how to download and install OpenProject on your own servers. Enterprise add-ons Find out about the OpenProject Enterprise add-ons to boost your project management. Enterprise add-ons Find out about the OpenProject Enterprise add-ons to boost your project management. OpenProject hos",
  "description": "Open source project management software for classic, agile or hybrid project management: task management✓ Gantt charts✓ boards✓ team collaboration✓ time and cost reporting✓ FREE trial!",
  "links": [
    "https://www.openproject.org/api/#openproject-api",
    "https://www.openproject.org/api/#api-v3",
    "https://www.openproject.org/api/#openapi-specification",
    "https://www.openproject.org/api/#bcf-v21",
    "https://www.openproject.org/api/#openproject-api",
    "https://www.openproject.org/api/#api-v3",
    "https://www.openproject.org/docs/api/introduction",
    "https://www.openproject.org/api/#openapi-specification",
    "https://www.openproject.org/docs/api/v3/spec.json",
    "https://www.openproject.org/docs/api/v3/spec.yml",
    "https://www.openproject.org/api/#bcf-v21",
    "https://www.openproject.org/docs/api/bcf-rest-api",
    "https://www.openproject.org/api/#help-and-feedback",
    "https://www.openproject.org/api/#get-help",
    "https://www.openproject.org/api/#docs-feedback",
    "https://www.openproject.org/api/#product-feedback",
    "https://www.openproject.org/api/#get-more-features",
    "https://www.openproject.org/docs/glossary/",
    "https://www.openproject.org/contact/",
    "https://www.openproject.org/docs/development/report-a-bug/"
  ],
  "entities": [],
  "language": "en",
  "content_hash": "68bd10d2f5caeefba5d6bc7db4d490f50f191d3f5be6e789f9678dee222c358b"
}