{
  "title": "Notifications - OpenProject",
  "url": "https://www.openproject.org/docs/user-guide/notifications/",
  "published_at": null,
  "updated_at": "2025-11-28T16:21:39.806736",
  "author": null,
  "tags": [
    "notifications",
    "openproject",
    "notification",
    "work",
    "package",
    "that",
    "your",
    "will",
    "guide",
    "learn"
  ],
  "content_type": "webpage",
  "word_count": 1616,
  "content": "On this page   An overview of in-app notifications   Access in-app notifications   Manage notifications   Mark notifications as read   Notifications outside of Notification Center An overview of in-app notifications Access in-app notifications Manage notifications Mark notifications as read Notifications outside of Notification Center Notifications This page will explain how in-app notifications work and how to use them. An overview of in-app notifications With in-app notifications, you will be notified about important changes that are relevant to you, whether they are new comments that mention you, updates to status, type or dates or new assignments. The in-app notifications can work as an alternative to email notifications or be used in parallel. This feature is enabled by default. Your browser does not support the video tag. Access in-app notifications When there are notifications that require your attention, you will see a red badge on the notification bell icon on the right edge of the top header. The number on the badge indicates the number of total unread notifications (up to 99, after which the badge will simply indicate “99+”). To view the notifications, click the bell icon at the top right of the header. This will take you to Notification center. Each row in Notification center is a work package that has generated a notification. It is possible that you have received multiple notifications for the same work package (if, for example, the date of a work package you are watching was changed by one person and then the status later change by another, that would generate two notifications). A blue badge on the right edge of each row displays the number of unread notifications concerning that particular work package. The work packages are listed in order of freshness. The work packages on top of the list have the “newest” notifications. This means if there is a new update to a work package that was further down in your notification list, it will be moved to the top since that is now the newest notification. Note If multiple notifications exist for a single work package, the work package reminder will take precedence, showing the reminder note at the bottom of the page if one exists. In case a work package has both a reminder and a date alert notification set up, then the date alert is combined with the reminder note such that that both are visible in the last line. If there are additional reasons for the notification (watcher, mentioned, assignee), those will continue to be displayed in first line of the notification. Manage notifications Click on a notification to open the Activity tab of this work package in split screen. If you double click on a notification, it will open the full view of a work package. Tip You can adjust the split screen by moving the resizer on the left side of the split screen, it will be stored locally and used for other split screen layouts. The Activity tab will auto-scroll to the last event that generated a notification. Badges next to the tabs indicate number of content, e.g. number 1 next to the tab Relations indicates that current work package is related to one more work package. Tip Not all work package activity generate notifications. For example, if you received a notification because you were mentioned, there might be other activities on that work package after that, even though the Activity tab will auto-scroll to highlight the mention when you click on the notification, since the mention was originally what triggered the notification. You can filter or group notifications by using the two sets of predefined filters on the left-hand menu: (Area 1) You can filter by the reason you were notified: because you were mentioned (@mention), because you are either the assignee or accountable for that work package, because it concerns a work package you are watching or because you have an active reminder or a date alert. (Area 2) You can filter by project (area 2), for example to filter for notifications that originated from a specific project. (Area 3) You can also affect which notifications are visible on the screen: You can also choose to view either only Unread notification or All, which will also display notifications previously marked as read. You can also Mark all as read if you want to clean your notification inbox in one click. Tip The Mark all as read button clears all visible notification rows. If you have a very large number unread notifications, the oldest ones might not be visible on the page. In this case, you might have to click the button multiple times to clear your inbox completely. (Area 4) If you would like to view your current notification preferences or modify them, click on the Notification settings button. You can also access your settings via your Avatar in the top right corner > Account settings> Notification settings. (Area 5) The split screen view lets you not only view work package activity as previously described, but also lets you access a",
  "description": "An over view of how in-app notifications work in OpenProject and how to manage them.",
  "links": [
    "https://www.openproject.org/docs/user-guide/notifications/#notifications",
    "https://www.openproject.org/docs/user-guide/notifications/#an-overview-of-in-app-notifications",
    "https://www.openproject.org/docs/user-guide/notifications/#access-in-app-notifications",
    "https://www.openproject.org/docs/user-guide/notifications/#manage-notifications",
    "https://www.openproject.org/docs/user-guide/notifications/#mark-notifications-as-read",
    "https://www.openproject.org/docs/user-guide/notifications/#notifications-outside-of-notification-center",
    "https://www.openproject.org/docs/user-guide/notifications/#notifications",
    "https://www.openproject.org/docs/user-guide/notifications/#an-overview-of-in-app-notifications",
    "https://www.openproject.org/docs/user-guide/notifications/#access-in-app-notifications",
    "https://www.openproject.org/docs/user-guide/notifications/#manage-notifications",
    "https://www.openproject.org/docs/user-guide/notifications/#mark-notifications-as-read",
    "https://www.openproject.org/docs/user-guide/notifications/#notifications-outside-of-notification-center",
    "https://www.openproject.org/docs/user-guide/notifications/#an-overview-of-in-app-notifications",
    "https://www.openproject.org/docs/user-guide/notifications/#access-in-app-notifications",
    "https://www.openproject.org/docs/user-guide/work-packages/edit-work-package/#work-package-reminders",
    "https://www.openproject.org/docs/user-guide/notifications/#manage-notifications",
    "https://www.openproject.org/docs/user-guide/notifications/notification-settings",
    "https://www.openproject.org/docs/user-guide/account-settings/#email-reminders",
    "https://www.openproject.org/docs/user-guide/notifications/#mark-notifications-as-read",
    "https://www.openproject.org/docs/user-guide/notifications/#notifications-outside-of-notification-center"
  ],
  "entities": [],
  "language": "en",
  "content_hash": "ddc5451bb44f9fac647ceb6fe1763999b35441e13b2d333485994b2c33715691"
}