{
  "title": "Repository for source code control - OpenProject",
  "url": "https://www.openproject.org/docs/user-guide/repository/",
  "published_at": null,
  "updated_at": "2025-11-28T16:21:43.063756",
  "author": null,
  "tags": [
    "openproject",
    "repository",
    "guide",
    "your",
    "learn",
    "with",
    "files",
    "project",
    "enterprise",
    "about"
  ],
  "content_type": "webpage",
  "word_count": 1134,
  "content": "On this page   Repository browser view   Working with an SVN or Git client   Reference work packages   Configure Repositories in OpenProject   Repository integration Repository browser view Working with an SVN or Git client Reference work packages Configure Repositories in OpenProject Repository integration Repository for source code control Repository is defined as a document management system that allows users to manage files and folders via different version control system (SVN or Git). Note: Repositories are currently only available for the packaged-based on-premises installations. In order to use Repository functionality please make sure that the Repository module is activated in the project settings. Repository browser view An important part of working on a project as a team is sharing files and source code. Keeping track of the latest versions can sometimes be a challenge. Therefore, OpenProject provides two types of version control systems (Git and Subversion) which – after being properly configured – can be used to store relevant data in the different projects. In OpenProject you can view the files under Repository. Please keep in mind that from your OpenProject website you can only view or download the files. For committing new files you need an SVN- or Git-client. In order to be able to edit files and to upload the updated versions to repository, you need to check out your repository. The following steps assume you have configured your OpenProject repository to work with subversion (but many of the options are very similar or identical when using Git). Please check out the repository and save it locally through an SVN client of your choice. Below the list of files you can see the latest revisions and the changing comments. If you select a specific file, you will see the list of its revisions. You can create a comparison of two versions to see the changes made for specific files. Please keep in mind that this comparison option is available for single files, so a specific file has to be selected, not a folder. Hint: the comparison only works for plain Text Files (e.g. xml, yaml, json, html, etc.) and not for Binary Files (e.g. pdf, ppt, doc, images, audio- or archive files, etc.). Working with an SVN or Git client The data contained in a project repository can be downloaded to your computer using one of several clients, for example Tortoise SVN for Subversion, and the git client or one of the recommended GUI clients for Git. The specifics of working of the selected version control client may vary. Please refer to the documentation of your version control software client for more information. If you choose to use Tortoise SVN, you will find a good guide here. For Git, we recommend the Pro Git guide. Reference work packages In the commit message you can reference a work package ID (e.g. #1234). In the repository settings (Administration -> System settings -> Repository) you can define keywords that change the status of the referenced work package (e.g. fixes #1234 or closes #1234). In any textile field you can reference revisions by putting an “r” in front of the revision number (e.g. r123). Configure Repositories in OpenProject Please see our system admin guide how to configure repositories in OpenProject. Repository integration See our Installation and operations guide how to integrate repositories in OpenProject. Help and feedback Get help Get help Docs feedback Docs feedback Product feedback Product feedback Get more features Get more features Look up project management terms in our dictionary If you need help from the community or want to support others If you are eligible for professional support and have more questions If you find an easily fixable error or need for improvement in the documentation If you would like to suggest bigger updates or improvements to this documentation If you want to contribute to translate this documentation to another language If there’s something you don’t like or understand about this feature If you want to propose a new feature that OpenProject does not offer yet To further help OpenProject to shape and test new features To view OpenProject Enterprise add-ons and pricing If you want to try all Enterprise add-ons in the OpenProject Enterprise cloud 14 days for free If you want to try all Enterprise add-ons in your on premise Community installation 14 days for free On this page   Repository browser view   Working with an SVN or Git client   Reference work packages   Configure Repositories in OpenProject   Repository integration Repository browser view Working with an SVN or Git client Reference work packages Configure Repositories in OpenProject Repository integration All User guides Docs Blog Website API Release notes First steps   Getting started Learn about the first steps with OpenProject Getting started Learn about the first steps with OpenProject All features   User guide In-depth guide of all features in OpenProject User guide In-depth guide of ",
  "description": "Manage repositories with SVN or GIT in OpenProject.",
  "links": [
    "https://www.openproject.org/docs/user-guide/repository/#repository-for-source-code-control",
    "https://www.openproject.org/docs/user-guide/repository/#repository-browser-view",
    "https://www.openproject.org/docs/user-guide/repository/#working-with-an-svn-or-git-client",
    "https://www.openproject.org/docs/user-guide/repository/#reference-work-packages",
    "https://www.openproject.org/docs/user-guide/repository/#configure-repositories-in-openproject",
    "https://www.openproject.org/docs/user-guide/repository/#repository-integration",
    "https://www.openproject.org/docs/user-guide/repository/#repository-for-source-code-control",
    "https://www.openproject.org/docs/user-guide/projects/project-settings/modules",
    "https://www.openproject.org/docs/user-guide/repository/#repository-browser-view",
    "https://www.openproject.org/docs/user-guide/repository/#working-with-an-svn-or-git-client",
    "https://www.openproject.org/docs/user-guide/repository/#reference-work-packages",
    "https://www.openproject.org/docs/user-guide/repository/#configure-repositories-in-openproject",
    "https://www.openproject.org/docs/system-admin-guide/system-settings/repositories",
    "https://www.openproject.org/docs/user-guide/repository/#repository-integration",
    "https://www.openproject.org/docs/installation-and-operations/configuration/repositories/#repository-integration-in-openproject",
    "https://www.openproject.org/docs/user-guide/repository/#help-and-feedback",
    "https://www.openproject.org/docs/user-guide/repository/#get-help",
    "https://www.openproject.org/docs/user-guide/repository/#docs-feedback",
    "https://www.openproject.org/docs/user-guide/repository/#product-feedback",
    "https://www.openproject.org/docs/user-guide/repository/#get-more-features"
  ],
  "entities": [],
  "language": "en",
  "content_hash": "6fecfbe2ab26b467669680578e2253cab56e40fb863985fd8e538be29bf195ea"
}