{
  "title": "Forums - OpenProject",
  "url": "https://www.openproject.org/docs/user-guide/forums/",
  "published_at": null,
  "updated_at": "2025-11-28T16:21:44.804075",
  "author": null,
  "tags": [
    "forum",
    "message",
    "openproject",
    "your",
    "project",
    "watch",
    "unwatch",
    "guide",
    "click",
    "about"
  ],
  "content_type": "webpage",
  "word_count": 1519,
  "content": "On this page   Open a forum   Create a new forum   Manage forums   Create a new message in a forum   Reply to a forum message   Watch a forum   Watch a message     Unwatch a forum   Unwatch a message     Edit a forum message   Delete a forum message Open a forum Create a new forum Manage forums Create a new message in a forum Reply to a forum message Watch a forum   Watch a message Watch a message Unwatch a forum   Unwatch a message Unwatch a message Edit a forum message Delete a forum message Forums In the forum in OpenProject you can discuss topics in a project with the team: post questions, comment on it and document answers. Forum is defined as a module used to display forums and forum entries. The module has to be activated in the project settings and a forum has to be created in the Forums tab in the project settings to be displayed in the side navigation. Open a forum To work in the forum in OpenProject, select the menu item Forums in the project navigation. You will get a list of all existing forums within a project as well as a short description for it, the number of topics, messages as well as the last message within one forum. Click on the Forum title to open an existing forum. Create a new forum To create a new forum in your project, navigate to the Forums module in the left side menu and click the + Forum button. Enter a name and description for the new forum. Press the Create button so save the new forum. Manage forums If you want to change the order of the forums in your project, want to edit a forum, or delete a forum, go to the Forums overview list in your project. Click the arrows (up or down) to change the order of the forums and sort them differently in the forum list in your project. Click the edit icon to change the name or description of your forum. Click the delete icon to delete a forum from your project. Create a new message in a forum To add a new message within an existing forum, click the green + Message button on the top right of the selected forum. Enter the subject of the message. You can choose whether the message should be Sticky. A sticky message always appears on top of the selected forum. Select if a message should be Locked. Then it can no longer be edited or commented by the project team. Enter a description which will then appears next to the message title in the forum. You can add a file if needed. Click the Create button to create the new message for this forum. The new forum message has been created. Tip Changes you made are saved locally. If you navigated away from page or could not save your changes due to a technical difficulty, you can access latest changes via the editor toolbar. Reply to a forum message To add a reply to an existing message in a forum, click on the Subject in order to open the message. Underneath the forum message you want to reply to, you will directly see subject and message fields. Enter your Message content what you want to add as a reply to the existing message. You can choose to also add a file if needed. Click the Submit button in order to save your reply message. The reply has been added under the existing forum message. Watch a forum To keep informed about changes in a forum, e.g. new messages or new replies, you can add yourself as a Watcher of a forum. Open an existing forum from the list. You will get a list of all messages within this forum. Click the Watch icon in the top right corner of the forum. You will then be notified via e-mail according to your e-mail notifications about new messages and replies in a forum. The icon will then change to Unwatch. Watch a message If you watch a forum you will automatically watch all messages within this forum. Alternatively, you can also watch only certain messages within a forum where you want to be informed about changes. This way, you select the message first by clicking on the subject, and then click the Watch button on the top right corner in the message details. Unwatch a forum To unwatch a forum in order to not be informed via e-mail about new messages and replies in a forum, click the Unwatch button on the top right of the forum. Unwatch a message The same applies to unwatch a message. Just select the message first which you do not want to watch any longer and click the Unwatch button. Edit a forum message To edit a message in a forum select the message from the forum and in the message details click the Edit button in the top right corner of the message. The message details will then be opened. You can make your changes and click the Save button. Delete a forum message To delete a message in a forum, select the message which you want to delete and press the Delete button in the top right corner of the message details. Help and feedback Get help Get help Docs feedback Docs feedback Product feedback Product feedback Get more features Get more features Look up project management terms in our dictionary If you need help from the community or want to support others If you are eligible f",
  "description": "Create and manage a forum in OpenProject",
  "links": [
    "https://www.openproject.org/docs/user-guide/forums/#forums",
    "https://www.openproject.org/docs/user-guide/forums/#open-a-forum",
    "https://www.openproject.org/docs/user-guide/forums/#create-a-new-forum",
    "https://www.openproject.org/docs/user-guide/forums/#manage-forums",
    "https://www.openproject.org/docs/user-guide/forums/#create-a-new-message-in-a-forum",
    "https://www.openproject.org/docs/user-guide/forums/#reply-to-a-forum-message",
    "https://www.openproject.org/docs/user-guide/forums/#watch-a-forum",
    "https://www.openproject.org/docs/user-guide/forums/#watch-a-message",
    "https://www.openproject.org/docs/user-guide/forums/#unwatch-a-forum",
    "https://www.openproject.org/docs/user-guide/forums/#unwatch-a-message",
    "https://www.openproject.org/docs/user-guide/forums/#edit-a-forum-message",
    "https://www.openproject.org/docs/user-guide/forums/#delete-a-forum-message",
    "https://www.openproject.org/docs/user-guide/forums/#forums",
    "https://www.openproject.org/docs/user-guide/forums/#open-a-forum",
    "https://www.openproject.org/docs/user-guide/forums/#create-a-new-message-in-a-forum",
    "https://www.openproject.org/docs/user-guide/forums/#reply-to-a-forum-message",
    "https://www.openproject.org/docs/user-guide/forums/#watch-a-forum",
    "https://www.openproject.org/docs/user-guide/forums/#edit-a-forum-message",
    "https://www.openproject.org/docs/user-guide/forums/#delete-a-forum-message",
    "https://www.openproject.org/docs/user-guide/forums/#create-a-new-forum"
  ],
  "entities": [],
  "language": "en",
  "content_hash": "2146ca5b4aad022e15eae5929ab3da8e95181e7c3250d622c5cc1fe4116c7af8"
}