{
  "title": "OpenProject Roadmap - Open Source Project Management Software",
  "url": "https://www.openproject.org/roadmap/",
  "published_at": null,
  "updated_at": "2025-11-21T00:40:58.453182",
  "author": null,
  "tags": [
    "openproject",
    "project",
    "with",
    "enterprise",
    "guide",
    "development",
    "closed",
    "learn",
    "work",
    "your"
  ],
  "content_type": "webpage",
  "word_count": 1157,
  "content": "OpenProject Roadmap We continuously improve OpenProject. Discover OpenProject's strategic roadmap Just like our source code, we are making the development roadmap transparent to the public. It shows all topics that we have recently released, are currently working on, and are planning for the future. The roadmap is automatically generated and is updated regularly from our Community instance, where you will find more details to all topics on the roadmap. Please note that the timeline and feature set are subject to change as we continue to develop OpenProject. Our open source philosophy drives this process, and we strive to remain open and transparent throughout the journey. For more details on features and versions already released, take a look at our release notes. Roadmap We never stop improving OpenProject. See recently released features as well as upcoming features and improvements we are working on: 2025 Q1 Support for large number of projects list view for very large project portfolios   closed Additional calculation methods and advanced configuration options for project progress reporting   closed Scheduling mode \"As soon as possible\" to automatically reschedule successors   closed Generate PDF document from a work package description   closed Time entries with legally required mandatory fields: start time and finish time   closed PDF export for time sheets   closed 2025 Q2 Manage personal time entries in list and calendar views   closed Project life cycle with phases and gates - Step 2: work package assignments and journalization    closed Apply standardized component for PageHeaders & SubHeaders in the missing rails based pages   closed Meeting backlogs   closed Automatically generated work package subjects    closed Seamless integration of user sessions of Nextcloud and OpenProject using OIDC & JWTs    closed Internal comments in the work package activity tab    closed 2025 Q3 Add an option to automatically sync the color mode with operating system preference   closed Allow SharePoint integration setup with more restrictive permissions   in development Add SCIM server functionality to OpenProject via SCIM API    closed Introduce hierarchical entities to organise projects into project -> programs -> portfolios    in development 2025 Q4 Live-collaboration for documents (v1)   in development New dashboard with widgets for projects, portfolios and programs in the \"Overview\"   in development Automatically create work packages by email - map IMAP inbox with work packages attributes    on hold Remove ui-Router and apply primerized PageHeaders on angular pages   in development Improve global searchbar   in specification Advanced workflow for creating meeting minutes during a meeting   in development Avoid duplication of meeting invitations so there is one single source of truth   in development Calculate project priority scores based on project attributes    in development Project start and finish dates and durations for project and project phases   in specification Support migration from Jira/Atlassian to OpenProject   in specification Work packages with reduced visibility (private work packages)   new 2026 Q1 Send email notifications to participants and external guest users from a work package   new Custom field type of \"Calculated value\" for work packages   new Allow time logging on meetings   specified Introduce \"Sprints\" for Scrum projects   in specification Custom fields for documents   new Apply standardized component for PageHeaders & SubHeaders in the missing angular based pages   new Primerise 'My account' and rearrange content for better UX   on hold On-the-fly creation of guest users in OIDC identity providers, e.g. Keycloak    new Making the product home page more relevant by integrating it with the My page widget   in specification Extended logging and auditing capabilities    new File requests    new Composition of file identifiers that satisfy existing file management plans    in specification Separate permissions to view and edit project attributes (restricted project attributes)    specified Work-in-Progress-Limits for Kanban boards    in specification Quadrant chart for project prioritization/scoring    new Personal calendars showing the individual availability    new Independent work package keys per project   new Structure boards with swimlanes    new Project status reporting    new Multiple Assignees without group creation   in specification Harmonized frontend with accessibility fixes for the Scrum Module (Backlogs)   new WBS numbering   new The OpenProject Enterprise add-ons are part of our Enterprise on-premises and cloud plans. With the upgrade to a paid version, you will support the development and maintenance of the open source project. The OpenProject Enterprise add-ons are part of our Enterprise on-premises and cloud plans. With the upgrade to a paid version, you will support the development and maintenance of the open source project. The OpenProject Enterprise add-ons are part",
  "description": "Open source project management software for classic, agile or hybrid project management: task management✓ Gantt charts✓ boards✓ team collaboration✓ time and cost reporting✓ FREE trial!",
  "links": [
    "https://www.openproject.org/docs/release-notes/",
    "https://www.openproject.org/docs/release-notes/",
    "https://www.openproject.org/enterprise-edition/",
    "https://www.openproject.org/enterprise-edition/",
    "https://www.openproject.org/enterprise-edition/",
    "https://www.openproject.org/enterprise-edition/",
    "https://www.openproject.org/docs/getting-started/",
    "https://www.openproject.org/docs/user-guide/",
    "https://www.openproject.org/docs/faq/",
    "https://www.openproject.org/docs/use-cases/",
    "https://www.openproject.org/docs/glossary/",
    "https://www.openproject.org/docs/enterprise-guide/",
    "https://www.openproject.org/docs/project-management-guide",
    "https://www.openproject.org/docs/security-and-privacy/",
    "https://www.openproject.org/docs/contributions-guide/",
    "https://www.openproject.org/docs/system-admin-guide/",
    "https://www.openproject.org/docs/release-notes/",
    "https://www.openproject.org/docs/bim-guide/",
    "https://www.openproject.org/docs/installation-and-operations/",
    "https://www.openproject.org/docs/development/"
  ],
  "entities": [],
  "language": "en",
  "content_hash": "591dc1a3bce1fe78de02c08802ff25a0d852f99bf251ab869a13ebe6fcd74471"
}