{
  "title": "Budgets - OpenProject",
  "url": "https://www.openproject.org/docs/user-guide/budgets/",
  "published_at": null,
  "updated_at": "2025-11-28T15:39:26.310495",
  "author": null,
  "tags": [
    "budget",
    "costs",
    "openproject",
    "planned",
    "your",
    "project",
    "this",
    "unit",
    "labor",
    "guide"
  ],
  "content_type": "webpage",
  "word_count": 1859,
  "content": "On this page   Create a project budget   Add planned unit costs   Add planned labor costs     Assign a work package to a budget   View details and update budget   Frequently asked questions (FAQ)   How do I prepare a budget in OpenProject? Create a project budget   Add planned unit costs   Add planned labor costs Add planned unit costs Add planned labor costs Assign a work package to a budget View details and update budget Frequently asked questions (FAQ)   How do I prepare a budget in OpenProject? How do I prepare a budget in OpenProject? Budgets You can create and manage a project budget in OpenProject to keep track of your available and spent costs in a project. You can add planned unit costs as well as labor costs for the project. Then, you will assign work packages to a budgets. If you log time or costs to this work package the costs will booked to this budget and show the percentage spent for a project budget. Create a project budget Tip In order to create a budget in your project, the Budgets module needs to be activated under project settings. To create your first budget in OpenProject, navigate to Budgets module and click the green + Budget button in the top right corner. In the form that opens, you can define the details of your project budget, including planned unit costs and planned labor costs. Subject – Enter a clear subject for your budget so it can be identified easily. Subject – Enter a clear subject for your budget so it can be identified easily. Description – Add a detailed description with additional information such as the budget owner, status, or any other notes. Description – Add a detailed description with additional information such as the budget owner, status, or any other notes. Attachments – Upload supporting files by dragging and dropping them into the upload field, or by clicking the field to select files from your computer. Attachments – Upload supporting files by dragging and dropping them into the upload field, or by clicking the field to select files from your computer. Fixed date – Specify a fixed date. This date is used to calculate planned costs based on either:  the configured hourly rate in the users profile, or the cost types set by administrator.  Since rates can be configured for different date ranges, the fixed date ensures the correct costs are calculated for the budget. Fixed date – Specify a fixed date. This date is used to calculate planned costs based on either: the configured hourly rate in the users profile, or the cost types set by administrator. Since rates can be configured for different date ranges, the fixed date ensures the correct costs are calculated for the budget. Base amount - Enter a lump-sum amount to allocate funds without planning materials or labor costs in detail. This is useful for high-level budgets where you simply assign an overall sum instead of tracking specific items. Base amount - Enter a lump-sum amount to allocate funds without planning materials or labor costs in detail. This is useful for high-level budgets where you simply assign an overall sum instead of tracking specific items. Add planned unit costs You can add planned unit costs to a budget in your project. These unit costs first need to be configured in the system’s administration. Enter the number of units of the cost type to add to your project budgets. Choose the cost type you would like to plan for your budget from the drop-down list. The unit name will be set automatically according to the configuration of the cost types in your system administration. Add a comment to specify the unit costs. The planned costs for this cost type will be calculated automatically based on the configuration of the cost per unit for this cost type. The cost rate will be taken from the fixed date you have configured for your budget. You can click the edit icon (small pen) if you want to manually overwrite the calculated costs for this cost type. Click the delete icon if you want to drop the planned unit costs. The + icon will add a new unit cost type for this budget. Add planned labor costs You can also add planned labor costs to a budget. Set the hours that will be planned for a user on this budget. Add a user from the drop-down list. You can include a comment for your planned labor costs if needed. The total amount of planned costs will be calculated based on the entered hours and the hourly rate configured for this user in the user profile. You can manually overwrite the calculated planned labor costs by clicking the edit icon (pen) next to the calculated amount. The costs will be calculated based on the hourly rate taken from the fixed date for your budget. With the delete icon you can remove the planned labor costs from the budget. Add more planned labor costs for different users to your budget with the + icon. Save and submit your changes by pressing the Create button. Assign a work package to a budget To add a work package to a project budget to book time and costs t",
  "description": "Find out how to create and manage budgets for a project in OpenProject.",
  "links": [
    "https://www.openproject.org/docs/user-guide/budgets/#budgets",
    "https://www.openproject.org/docs/user-guide/budgets/#create-a-project-budget",
    "https://www.openproject.org/docs/user-guide/budgets/#add-planned-unit-costs",
    "https://www.openproject.org/docs/user-guide/budgets/#add-planned-labor-costs",
    "https://www.openproject.org/docs/user-guide/budgets/#assign-a-work-package-to-a-budget",
    "https://www.openproject.org/docs/user-guide/budgets/#view-details-and-update-budget",
    "https://www.openproject.org/docs/user-guide/budgets/#frequently-asked-questions-faq",
    "https://www.openproject.org/docs/user-guide/budgets/#how-do-i-prepare-a-budget-in-openproject",
    "https://www.openproject.org/docs/user-guide/budgets/#budgets",
    "https://www.openproject.org/docs/user-guide/budgets/#create-a-project-budget",
    "https://www.openproject.org/docs/user-guide/budgets/#add-planned-unit-costs",
    "https://www.openproject.org/docs/user-guide/budgets/#add-planned-labor-costs",
    "https://www.openproject.org/docs/user-guide/budgets/#assign-a-work-package-to-a-budget",
    "https://www.openproject.org/docs/user-guide/budgets/#view-details-and-update-budget",
    "https://www.openproject.org/docs/user-guide/budgets/#frequently-asked-questions-faq",
    "https://www.openproject.org/docs/user-guide/budgets/#create-a-project-budget",
    "https://www.openproject.org/docs/user-guide/projects",
    "https://www.openproject.org/docs/user-guide/time-and-costs/cost-tracking",
    "https://www.openproject.org/docs/system-admin-guide",
    "https://www.openproject.org/docs/user-guide/budgets/#add-planned-unit-costs"
  ],
  "entities": [],
  "language": "en",
  "content_hash": "07ab85457f401b641d1b868ba6e580260bf17951a0fab1ce4839e0cb4fd2936e"
}