{
  "title": "Team planner - OpenProject",
  "url": "https://www.openproject.org/docs/user-guide/team-planner/",
  "published_at": null,
  "updated_at": "2025-11-28T15:39:31.562416",
  "author": null,
  "tags": [
    "work",
    "team",
    "package",
    "planner",
    "openproject",
    "packages",
    "that",
    "this",
    "your",
    "view"
  ],
  "content_type": "webpage",
  "word_count": 2686,
  "content": "On this page   Module overview   Team planner basics   Add team members and work packages   Add team members   Add and edit work packages     Work package details view   Remove a work package Module overview Team planner basics Add team members and work packages   Add team members   Add and edit work packages Add team members Add and edit work packages Work package details view Remove a work package Team planner The team planner module helps you get a complete overview of what each member of your team is working on. You can use it to track the current progress of work packages your team is working on, schedule new tasks, reschedule them or even reassign them to different members. Essentially, the team planner is a calendar view with an assignee column on the left side. Each work package assigned to a team member will appear as a card that spans a certain duration (start date to finish date). These cards can be moved, stretched, shortened or removed to organize the planning of your team. To use this module, you must have the work packages module enabled. Your browser does not support the video tag. Module overview Clicking on the Team planners entry on the left sidebar takes you to the team planner module with a list of all existing team planners: You can create a new team planner using either the + Team planner button in the top right near your avatar or at the bottom of the left menu bar. Click on an existing (saved) team planner to open it. Team planners marked as favorite under visibility settings appear under the Favorite heading in the menu bar. Team planners with public visibility settings appear under the Public heading in the menu bar. New team planners by default appear under the Private heading in the left menu bar. These are visible only to you. Tip Both public and private team planners can be added as favorited planners. Team planner basics A team planner has a number of features numbered 1 to 8 in the above screenshot: Click on the name of your team planner (Marketing Team in the example above) to edit it. Unless it’s a new team planner, this change has to be confirmed by pressing the floppy disk icon that appears next to the name after you change it. Click on the name of your team planner (Marketing Team in the example above) to edit it. Unless it’s a new team planner, this change has to be confirmed by pressing the floppy disk icon that appears next to the name after you change it. Use the + Add existing button to add an existing work package to the team planner. You do this by searching for work package and dragging its card to an assignee, at a certain time. This will then update the assignee, start date and finish date attributes of that work package. Use the + Add existing button to add an existing work package to the team planner. You do this by searching for work package and dragging its card to an assignee, at a certain time. This will then update the assignee, start date and finish date attributes of that work package. Add a new team member to the assignee column by Clicking on the + Assignee button. Add a new team member to the assignee column by Clicking on the + Assignee button. By default, the team planner will only show assigned work packages belonging to the current project. By default, the team planner will only show assigned work packages belonging to the current project. Tip It is possible to also add assigned work packages belonging to other projects. You can make these work packages from other projects visible by using Include projects feature and selecting additional projects to be included in this view. Use the Filter feature (same as in the work packages module) to display only work packages that meet certain filter criteria. You could, for example, filter such that only work packages of certain types, certain status or certain custom field values are visible. Use the Filter feature (same as in the work packages module) to display only work packages that meet certain filter criteria. You could, for example, filter such that only work packages of certain types, certain status or certain custom field values are visible. The Fullscreen button lets you view the team planner in fullscreen mode. The Fullscreen button lets you view the team planner in fullscreen mode. The [⋮] (more) button gives you additional options, such as saving, renaming and saving a copy (saving as), or deleting the team planner. This is also where you can modify the visibility options. The [⋮] (more) button gives you additional options, such as saving, renaming and saving a copy (saving as), or deleting the team planner. This is also where you can modify the visibility options. By default the team planner only shows the work week (week excluding the weekend and non-working days). Use the drop down to toggle between work week, 1-week, 2-week, 4-week or 8-week views. With the arrows you can navigate the weeks back and forth. The Today button brings you to the current week. By default the team plan",
  "description": "Using the team planner module in OpenProject.",
  "links": [
    "https://www.openproject.org/docs/user-guide/team-planner/#team-planner",
    "https://www.openproject.org/docs/user-guide/team-planner/#module-overview",
    "https://www.openproject.org/docs/user-guide/team-planner/#team-planner-basics",
    "https://www.openproject.org/docs/user-guide/team-planner/#add-team-members-and-work-packages",
    "https://www.openproject.org/docs/user-guide/team-planner/#add-team-members",
    "https://www.openproject.org/docs/user-guide/team-planner/#add-and-edit-work-packages",
    "https://www.openproject.org/docs/user-guide/team-planner/#work-package-details-view",
    "https://www.openproject.org/docs/user-guide/team-planner/#remove-a-work-package",
    "https://www.openproject.org/docs/user-guide/team-planner/#team-planner",
    "https://www.openproject.org/pricing/",
    "https://www.openproject.org/docs/user-guide/team-planner/#module-overview",
    "https://www.openproject.org/docs/user-guide/team-planner/#team-planner-basics",
    "https://www.openproject.org/docs/user-guide/team-planner/#add-team-members-and-work-packages",
    "https://www.openproject.org/docs/user-guide/team-planner/#work-package-details-view",
    "https://www.openproject.org/docs/user-guide/team-planner/#remove-a-work-package",
    "https://www.openproject.org/docs/user-guide/team-planner/#module-overview",
    "https://www.openproject.org/docs/user-guide/team-planner/#team-planner-basics",
    "https://www.openproject.org/docs/user-guide/work-packages/work-package-table-configuration/#filter-work-packages",
    "https://www.openproject.org/docs/system-admin-guide/calendars-and-dates/#working-days-and-hours",
    "https://www.openproject.org/docs/user-guide/work-packages/set-change-dates/#working-days-and-duration"
  ],
  "entities": [],
  "language": "en",
  "content_hash": "bb1cb4f0c9cff9745c219bef0403fec956c613d29ae24535f9f951246dc838d6"
}